[
{"product_name": ["Hawaii Ka'u"], "product_desc": ["Sea turtles were basking in the sun and nesting on this land long before it was given the name Ka`u. Today, life in this sparsely populated part of Hawaii continues to be slow-paced. With the high elevation and cool nights, even the coffee cherries mature more slowly in Ka`u. And with deep, nutrient-rich volcanic soil, these farms are producing coffees coveted around the world for their distinctive sweetness. This coffee is a simple way to joyfully share life—the spirit of Aloha."], "product_price": ["24.50"]},
{"product_name": ["Veranda Blend® Portion Packs"], "product_desc": ["In Latin America, coffee farms are often run by families, with their own homes on the same land where their coffee grows. We’ve sipped coffee with these farmers for decades, sitting on their verandas, overlooking the lush beauty of the coffee trees rolling out in the distance. Most times it was a lightly roasted coffee like this one. It took us more than 80 tries to get it right—mellow and flavorful with a nice softness.", "Each 2.5 oz portion pack of ground coffee is pre-measured to brew one pot of coffee, approximately 50-64 fl oz depending on the desired strength."], "product_price": ["42.95"]},
{"product_name": ["Sun-Dried Brazil Sertão"], "product_desc": ["The Sertão Estate is hailed as one of the first farms to produce coffee in Brazil’s Carmo de Minas region. Under José Isidoro Pereira and Nazareth Dias Pereira, three generations have thrived on the area’s steep, sprawling hillsides. With children and grandchildren now involved in running the farm, traditions are growing and evolving to include roasting and exporting coffee, and even sharing a coffee shop with the community.", "It’s a rich family legacy, and it culminates in a wonderfully distinctive flavor enhanced by the sun-dried method. Every cup unfolds with a bright, delicate sweetness, reflecting the deep connection between a family and the land they’ve come to know and love."], "product_price": ["17.50"]},
{"product_name": ["East Timor Peaberry"], "product_desc": ["Located about 400 miles off Australia’s northern coast, the mountainous island nation of Timor is dotted with tiny coffee farms. Here, in collaboration with Cooperativa Café Timor, Starbucks is proud to play a continued role in improving access to quality health care by helping fund eight medical clinics—getting thousands of co-op members and their families the medical attention they need.", "Amid difficult terrain and a lack of resources, advancements like sanitary facilities and reliable emergency communication systems change lives—and underscore the belief that healthier communities grow exceptional coffee. This peaberry lot, available exclusively from Starbucks, is a prime example: sweet, floral and extraordinary."], "product_price": ["12.50"]},
{"product_name": ["Fair Trade Certified™ Cafè Estima Blend® Portion Packs"], "product_desc": ["Velvety smooth and balanced with the sweet flavor of dark roast, this blend of coffees from Latin America and East Africa is the product of the relationships formed between Starbucks and small-scale coffee farmers. As one of the largest purchasers of Fair Trade Certified", " coffee, Starbucks is committed to paying fair prices to help give farming families a better life and ensure coffee farms are protected for the future. ", "Each 2.5 oz portion pack of ground coffee is pre-measured to brew one pot of coffee, approximately 50-64 fl oz depending on the desired strength."], "product_price": ["42.95"]},
{"product_name": ["Sumatra Portion Packs"], "product_desc": ["Like the lush Indonesian island of its origin, this spicy coffee stands alone. Full-bodied with a smooth mouthfeel, lingering flavors of dried herbs and fresh earth, and almost no acidity. Our roasters love transforming these unpredictable beans from dark coral green to tiger-orange to a rich, oily mahogany, revealing bold flavors that many of us can’t live without. Coffee from Sumatra is the foundation of our most treasured blends, and something we’ve been honored to share with you for four decades.", "Each 2.5 oz portion pack of ground coffee is pre-measured to brew one pot of coffee, approximately 50-64 fl oz depending on the desired strength."], "product_price": ["42.95"]},
{"product_name": ["Breakfast Blend Portion Packs"], "product_desc": ["We introduced this blend in 1998 for those who prefer a milder cup. A shade lighter than most of our offerings—more toasty than roasty—it was the result of playing with roast and taste profile together for a flavor that appealed to a wider range of palates. Perfect if you want to wake up to a less intense coffee but still want a lot of character, it's lively with a citrusy tang that gives way to a clean finish.", "Each 2.5 oz portion pack of ground coffee is pre-measured to brew one pot of coffee, approximately 50-64 fl oz depending on the desired strength."], "product_price": ["42.95"]},
{"product_name": ["Panama Carmen Estate"], "product_desc": ["Carlos Aguilera produces some of the world’s most celebrated specialty coffees on his family’s award-winning estate. The lush microclimate is influenced by its proximity to both the Atlantic and Pacific oceans. The rich volcanic soil of the Volcán Valley combined with cool, airy nights and dry, sun-filled days culminate in a distinctive taste—sparkling and bright with pronounced floral and citrus notes. It’s a flavor reflective of the extraordinary quality that Panama Carmen Estate has become renowned for."], "product_price": ["17.50"]},
{"product_name": ["Rwanda Abakundakawa"], "product_desc": ["\"We who love coffee.” This is the meaning of Abakundakawa, serving as a powerful mantra driving the farmers of this co-op to make their mark in Rwanda—and the coffee world at large. With a membership that’s nearly half women—a true rarity in the coffee world—this determined group lives up to its mission in various ways. Many of the women in the organization hold leadership roles, with their exemplary management culminating in award-winning coffees.", "From roasting and sampling on-site, to reinvesting income into school fees and community support, to moving toward fully organic processing methods, their pioneering ways produce a gorgeous coffee and an exceptional example. It is our second year offering Abakundakawa, and we are thrilled to witness the success of this remarkable group."], "product_price": ["12.50"]},
{"product_name": ["Decaf Costa Rica Hacienda Alsacia®"], "product_desc": ["Hacienda Alsacia, in Costa Rica’s storied Alajuela Province, is a farm with an established history—and in 2013 it became a personal part of ours. Here at our very own coffee farm, we deepen our knowledge of agronomy, our research of sustainability, and our commitment to the farmers who work the land. And in cultivating, harvesting and tasting each year’s crop, we experience a feeling unlike any other: the pride of seeing our own beans through, from seedling to cup. We are honored to share this coffee, an exceptional example of the flavors we have come to know and love from high-grown Costa Rican coffees."], "product_price": ["14.50"]},
{"product_name": ["French Roast Portion Packs"], "product_desc": ["Muted with oil, the tumbling beans become eerily silent. A master roaster watches, knowing that if he pushes them a second too long, they'll burst into flame. White smoke hangs down as the glistening beans turn ebony. This is French Roast, and you can't roast it darker. Straightforward, light-bodied with low acidity, and immensely popular since 1971, our darkest roast is adored for its intense smokiness.", "Each 2.5 oz portion pack of ground coffee is pre-measured to brew one pot of coffee, approximately 50-64 fl oz depending on the desired strength."], "product_price": ["42.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Malawi Sable Farms"], "product_desc": ["The consistently outstanding coffee coming out of Sable Farms is the result of a foundational belief: invest in the farming practices that support the environment and the people who support the farm. Southern Malawi, landlocked and hampered by a lack of infrastructure, is not an easy place to grow coffee. But these farmers pour their efforts into using their limited resources with a thoughtfulness that’s brought healthy growth and a global reputation.", "Using drip irrigation systems for precise watering, solar coffee dryers to save energy, composting, water reuse and filtering, and regular soil monitoring, their processing is the picture of environmental care. And they extend that same philosophy to the people within their coffee community."], "product_price": ["12.50"]},
{"product_name": ["Pike Place® Roast K-Cup® Pods"], "product_desc": ["From our first store in Seattle’s Pike Place Market to our coffeehouses around the world, customers requested a freshly brewed coffee they could enjoy throughout the day. So in 2008 our master blenders and roasters created it for you, a blend so consistent and harmonious that no single characteristic dominates—or disappears. A smooth, well-rounded blend of Latin American coffees with subtly rich flavors of cocoa and toasted nuts, it’s perfect for every day.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés."], "product_price": ["16.99"]},
{"product_name": ["D.R. Congo Kawa Kabuya"], "product_desc": ["Against a postcard backdrop of snowcapped mountains and wild jungles, the Kawa Kabuya co-op is producing coffees of exceptional quality. The Lubero and Beni districts of the eastern Democratic Republic of Congo border the Virunga National Park, an otherworldly spectacle of biological diversity, populated with gorillas and chimpanzees. The same mountains that serve as home to these great apes provide an exceptional climate for coffee cultivation—cool nighttime temperatures help the fruit mature slowly and evenly.", "Challenges presented by the rugged landscape and a lack of infrastructure are overcome by farmers determined to share the region’s unbelievable flavors with the rest of the world. The co-op gives these farmers a forum to share knowledge and build momentum for the crops they’ve worked passionately to cultivate."], "product_price": ["12.50"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Caramel Caffè Latte K-Cup® Pods"], "product_desc": ["Now you can enjoy café-style caramel lattes at home with your Keurig", " brewer. Indulge in the creamy bliss of dairy and caramel flavor specially crafted to complement our smooth, balanced Caffè Blend made from 100% ", " coffee. Every cup you make on your Keurig", " brewer will taste velvety rich and deliciously familiar.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés.", "CAFFÈ BLEND K-CUP", " POD INGREDIENTS: GROUND COFFEE.", "SWEETENED DAIRY PACKET INGREDIENTS: SUGAR, NONFAT DRY MILK, DRIED CREAM, NATURAL FLAVORS.", "CONTAINS MILK."], "product_price": ["11.99"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Veranda Blend® K-Cup® Pods"], "product_desc": ["In Latin America, coffee farms are often run by families, with their own homes on the same land where their coffee grows. We’ve sipped coffee with these farmers for decades, sitting on their verandas, overlooking the lush beauty of the coffee trees rolling out in the distance. Most times it was a lightly roasted coffee like this one. It took us more than 80 tries to get it right—mellow and flavorful with a nice softness.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés."], "product_price": ["16.99"]},
{"product_name": ["Breakfast Blend K-Cup® Pods"], "product_desc": ["We introduced this blend in 1998 for those who prefer a milder cup. A shade lighter than most of our offerings—more toasty than roasty—it was the result of playing with roast and taste profile together for a flavor that appealed to a wider range of palates. Perfect if you want to wake up to a less intense coffee but still want a lot of character, it's lively with a citrusy tang that gives way to a clean finish.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés."], "product_price": ["16.99"]},
{"product_name": ["Decaf Pike Place® Roast Portion Packs"], "product_desc": ["From our first store in Seattle’s Pike Place Market to our coffeehouses around the world, customers requested a freshly brewed coffee they could enjoy throughout the day. So in 2008 our master blenders and roasters created it for you, a blend so consistent and harmonious that no single characteristic dominates—or disappears. A smooth, well-rounded blend of Latin American coffees with subtly rich flavors of cocoa and toasted nuts, it’s perfect for every day.", "Each 2.5 oz portion pack of ground coffee is pre-measured to brew one pot of coffee, approximately 50-64 fl oz depending on the desired strength."], "product_price": ["42.95"]},
{"product_name": ["Mocha Caffè Latte K-Cup® Pods"], "product_desc": ["Now you can enjoy café-style mocha lattes at home with your Keurig", " brewer. Indulge in the creaminess of dairy and cocoa specially crafted to complement our smooth, balanced Caffè Blend made from 100% ", " coffee. Every cup you make on your Keurig", " brewer will taste velvety rich and deliciously familiar.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés.", "CAFFÈ BLEND K-CUP", " POD INGREDIENTS: GROUND COFFEE.", "SWEETENED DAIRY PACKET INGREDIENTS: SUGAR, NONFAT DRY MILK, DRIED CREAM, SEMISWEET CHOCOLATE POWDER (SUGAR, UNSWEETENED CHOCOLATE POWDER, DEXTROSE), COCOA (PROCESSED WITH ALKALI), NATURAL FLAVORS, SALT.", "CONTAINS MILK."], "product_price": ["11.99"]},
{"product_name": ["Crème Brulée K-Cup® Pods"], "product_desc": ["For an everyday cup of delight, our lighter-roasted coffee meets the rich flavors of custard and the caramel notes of burnt sugar generously accented with vanilla. For all your celebrations, we invite you to enjoy this deliciously sippable take on classic crème brulée.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés.", "INGREDIENTS: GROUND COFFEE, NATURAL FLAVORS."], "product_price": ["23.89"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Pike Place® Roast K-Cup® Pods"], "product_desc": ["From our first store in Seattle’s Pike Place Market to our coffeehouses around the world, customers requested a freshly brewed coffee they could enjoy throughout the day. So in 2008 our master blenders and roasters created it for you, a blend so consistent and harmonious that no single characteristic dominates—or disappears. A smooth, well-rounded blend of Latin American coffees with subtly rich flavors of cocoa and toasted nuts, it’s perfect for every day.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés."], "product_price": ["49.99"]},
{"product_name": ["Pike Place® Roast Portion Packs"], "product_desc": ["From our first store in Seattle’s Pike Place Market to our coffeehouses around the world, customers requested a freshly brewed coffee they could enjoy throughout the day. So in 2008 our master blenders and roasters created it for you, a blend so consistent and harmonious that no single characteristic dominates—or disappears. A smooth, well-rounded blend of Latin American coffees with subtly rich flavors of cocoa and toasted nuts, it’s perfect for every day.", "Each 2.5 oz portion pack of ground coffee is pre-measured to brew one pot of coffee, approximately 50-64 fl oz depending on the desired strength."], "product_price": ["42.95"]},
{"product_name": ["Cinnamon Dolce K-Cup® Pods"], "product_desc": ["Dolce is Italian for \"sweet,\" and this Blonde-roasted coffee is aptly-named. Notes of cinnamon, butter and brown sugar evoke handcrafted desserts—flavors that are nicely balanced by the mellow softness of the lighter-roasted blend.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés.", "INGREDIENTS: GROUND COFFEE, NATURAL FLAVORS."], "product_price": ["23.89"]},
{"product_name": ["Decaf House Blend K-Cup® Pods"], "product_desc": ["It’s deceptively simple. A blend of fine Latin American beans roasted to a glistening, dark chestnut color. Loaded with flavor, balancing tastes of nut and cocoa, just a touch of sweetness from the roast. This coffee is our beginning, the very first blend we ever created for you back in 1971. And this one blend set the course for the way our master blenders and roasters work even today. A true reflection of us and a delicious cup of coffee, period. It all starts from here.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés."], "product_price": ["23.89"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Vanilla K-Cup® Pods"], "product_desc": ["A generous kick of vanilla makes this coffee a deliciously satisfying treat. The recipe is an enticing blend of lighter-roasted beans and vanilla flavor that you can enjoy anytime. Add some tasty fun to your cup before brewing: ground cinnamon, brown sugar or hot chocolate mix.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés.", "INGREDIENTS: GROUND COFFEE, NATURAL FLAVORS."], "product_price": ["23.89"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Decaf Pike Place® Roast K-Cup® Pods"], "product_desc": ["From our first store in Seattle’s Pike Place Market to our coffeehouses around the world, customers requested a freshly brewed coffee they could enjoy throughout the day. So in 2008 our master blenders and roasters created it for you, a blend so consistent and harmonious that no single characteristic dominates—or disappears. A smooth, well-rounded blend of Latin American coffees with subtly rich flavors of cocoa and toasted nuts, it’s perfect for every day.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés."], "product_price": ["49.99"]},
{"product_name": ["Veranda Blend® K-Cup® Pods"], "product_desc": ["In Latin America, coffee farms are often run by families, with their own homes on the same land where their coffee grows. We’ve sipped coffee with these farmers for decades, sitting on their verandas, overlooking the lush beauty of the coffee trees rolling out in the distance. Most times it was a lightly roasted coffee like this one. It took us more than 80 tries to get it right—mellow and flavorful with a nice softness.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés."], "product_price": ["49.99"]},
{"product_name": ["Mocha Caffè Latte K-Cup® Pods"], "product_desc": ["Now you can enjoy café-style mocha lattes at home with your Keurig", " brewer. Indulge in the creaminess of dairy and cocoa specially crafted to complement our smooth, balanced Caffè Blend made from 100% ", " coffee. Every cup you make on your Keurig", " brewer will taste velvety rich and deliciously familiar.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés.", "CAFFÈ BLEND K-CUP", " POD INGREDIENTS: GROUND COFFEE.", "SWEETENED DAIRY PACKET INGREDIENTS: SUGAR, NONFAT DRY MILK, DRIED CREAM, SEMISWEET CHOCOLATE POWDER (SUGAR, UNSWEETENED CHOCOLATE POWDER, DEXTROSE), COCOA (PROCESSED WITH ALKALI), NATURAL FLAVORS, SALT.", "CONTAINS MILK."], "product_price": ["28.95"]},
{"product_name": ["House Blend K-Cup® Pods"], "product_desc": ["It’s deceptively simple. A blend of fine Latin American beans roasted to a glistening, dark chestnut color. Loaded with flavor, balancing tastes of nut and cocoa, just a touch of sweetness from the roast. This coffee is our beginning, the very first blend we ever created for you back in 1971. And this one blend set the course for the way our master blenders and roasters work even today. A true reflection of us and a delicious cup of coffee, period. It all starts from here.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés."], "product_price": ["23.89"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Nariño 70 Cold Brew Coffee"], "product_desc": ["Cold brew is a simple method that brews with time instead of heat for bold, cold, super-smooth coffee. Using your favorite 48 fl oz (or larger) pitcher, simply add cold water and steep two pitcher packs in the fridge for 24 hours for cold brew coffee you can enjoy for up to a week.", "Receive four pitcher packs, which together make twelve 8 fl oz servings."], "product_price": ["11.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Burundi Gitaba"], "product_desc": ["In the highlands of southern Burundi, experts at Gitaba washing station—renowned for delivering high-quality coffee year after year—are sharing their knowledge and offering technical support to local farmers. Together they’re improving coffee production during each step of the process. Cultivated in the Rutana Province—where this coffee flourishes under ideal growing conditions—the beans’ journey from farm to port is often challenging due to limited infrastructure and long travel distances.", "Well worth the effort, every sip astounds with an intense body and sweetness. But what really sets this coffee apart is the collaboration and hard work of farmers who understand the importance of their contribution: consistently high-quality beans help ensure excellence in the cup and a promising future."], "product_price": ["17.50"]},
{"product_name": ["Guatemala Antigua"], "product_desc": ["The Antigua Valley of Guatemala is treasured for its 100-year-old farms, nutrient-rich volcanic soil and its coffee, which is the touchstone of quality. Farmers take enormous pride in traditions they've passed on for generations. As a result, the coffee you experience is rich and multidimensional, with a flavor that’s consistent, cup after cup—lemon, chocolate and soft spice notes with an elegant mouthfeel unique to this region. It’s why we loved this coffee back in ’71, and why we love it today. "], "product_price": ["13.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Pike Place® Roast"], "product_desc": ["From our first store in Seattle’s Pike Place Market to our coffeehouses around the world, customers requested a freshly brewed coffee they could enjoy throughout the day. So in 2008 our master blenders and roasters created it for you, a blend so consistent and harmonious that no single characteristic dominates—or disappears. A smooth, well-rounded blend of Latin American coffees with subtly rich flavors of cocoa and toasted nuts, it’s perfect for every day."], "product_price": ["12.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Blonde Espresso Roast Espresso Verismo® Pods"], "product_desc": ["Drawing on four decades of coffee artistry, we started by combining select Latin American and East African beans, and then carefully roasted them to coax out their sweet, vibrant notes. The result is delightfully well-rounded and wonderfully versatile—delicious hot or served over ice.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés."], "product_price": ["11.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Espresso Roast Espresso Verismo® Pods"], "product_desc": ["Every espresso beverage we handcraft for you begins right here. Our master roasters coax the beans along, the heat taking them deep and dark—a recipe for caramelly sweetness so right it’s never been changed. The quest began in 1975 with a search for the perfect melding of beans and roast, ending months of intense experimentation later with the coffee you’re holding in your hand. A blend of beans from Latin America and Asia / Pacific, roasted the way only we can.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés."], "product_price": ["42.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Classic Hot Cocoa K-Cup® Pods"], "product_desc": ["An indulgent favorite inspired by Starbucks", " handcrafted hot chocolate. Created specifically for your Keurig", " machine, our Classic Hot Cocoa delivers a rich and creamy way to treat yourself, sip after satisfying sip.", "Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods come in flavors to fit any occasion.", "INGREDIENTS: SUGAR, ALKALIZED COCOA POWDER, COCONUT OIL, NONFAT DRY MILK, WHEY SOLIDS, SEA SALT, COCOA EXTRACT, SODIUM CASEINATE, NATURAL FLAVOR, DIPOTASSIUM PHOSPHATE, MONO- AND DIGLYCERIDES, STEVIOL GLYCOSIDES.", "CONTAINS MILK."], "product_price": ["12.95"]},
{"product_name": ["Pike Place® Roast Brewed Coffee Verismo® Pods"], "product_desc": ["From our first store in Seattle’s Pike Place Market to our coffeehouses around the world, customers requested a freshly brewed coffee they could enjoy throughout the day. So in 2008 our master blenders and roasters created it for you, a blend so consistent and harmonious that no single characteristic dominates—or disappears. A smooth, well-rounded blend of Latin American coffees with subtly rich flavors of cocoa and toasted nuts, it’s perfect for every day.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés."], "product_price": ["42.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Pike Place® Roast K-Cup® Pods"], "product_desc": ["From our first store in Seattle’s Pike Place Market to our coffeehouses around the world, customers requested a freshly brewed coffee they could enjoy throughout the day. So in 2008 our master blenders and roasters created it for you, a blend so consistent and harmonious that no single characteristic dominates—or disappears. A smooth, well-rounded blend of Latin American coffees with subtly rich flavors of cocoa and toasted nuts, it’s perfect for every day.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés."], "product_price": ["16.99"]},
{"product_name": ["VIA Instant Refreshers™ Very Berry Hibiscus"], "product_desc": ["Starbucks VIA Instant Refreshers", " Very Berry Hibiscus combines tangy blackberry with hints of hibiscus, sweet ginger and lemongrass, and pairs that with the natural energy from green, unroasted coffee beans. It's a breakthrough in instant refreshment that tastes nothing like coffee. Light, juicy and thirst-quenching, with a natural boost of caffeine to reenergize you. Enjoy Starbucks VIA Instant Refreshers", " single-serve packets wherever the moment takes you.", "INGREDIENTS: CANE SUGAR, GRAPE JUICE POWDERS (MALTODEXTRIN, GRAPE JUICE SOLIDS), NATURAL FLAVORS, FRUIT AND VEGETABLE JUICES FOR COLOR, MALIC ACID, GREEN COFFEE BEAN EXTRACT, ERYTHRITOL, CITRIC ACID, ASCORBIC ACID (VITAMIN C), REBAUDIOSIDE-A (STEVIA LEAF EXTRACT)."], "product_price": ["7.99"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["VIA Instant Refreshers™ Strawberry Lemonade"], "product_desc": ["Starbucks VIA Instant Refreshers", " Strawberry Lemonade combines juicy strawberry and tart, sweet lemonade with hints of lavender, along with green, unroasted coffee beans for a delicious strawberry lemonade-flavored energy boost. Light, juicy and thirst-quenching, with a natural boost of caffeine to reenergize you. Enjoy Starbucks VIA Instant Refreshers", " single-serve packets wherever the moment takes you.", "INGREDIENTS: CANE SUGAR, WHITE GRAPE JUICE POWDER (MALTODEXTRIN, GRAPE JUICE SOLIDS), NATURAL FLAVORS, CITRIC ACID, GREEN COFFEE BEAN EXTRACT, ERYTHRITOL, MALIC ACID, ASCORBIC ACID (VITAMIN C), REBAUDIOSIDE-A (STEVIA LEAF EXTRACT), FRUIT AND VEGETABLE JUICES FOR COLOR."], "product_price": ["7.99"]},
{"product_name": ["Nariño 70 Cold Brew Coffee"], "product_desc": ["Cold brew is a simple method that brews with time instead of heat for bold, cold, super-smooth coffee. Using your favorite 48 fl oz (or larger) pitcher, simply add cold water and steep two pitcher packs in the fridge for 24 hours for cold brew coffee you can enjoy for up to a week.", "Receive four pitcher packs, which together make twelve 8 fl oz servings."], "product_price": ["11.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Sun-Dried Brazil Sertão"], "product_desc": ["The Sertão Estate is hailed as one of the first farms to produce coffee in Brazil’s Carmo de Minas region. Under José Isidoro Pereira and Nazareth Dias Pereira, three generations have thrived on the area’s steep, sprawling hillsides. With children and grandchildren now involved in running the farm, traditions are growing and evolving to include roasting and exporting coffee, and even sharing a coffee shop with the community.", "It’s a rich family legacy, and it culminates in a wonderfully distinctive flavor enhanced by the sun-dried method. Every cup unfolds with a bright, delicate sweetness, reflecting the deep connection between a family and the land they’ve come to know and love."], "product_price": ["17.50"]},
{"product_name": ["Cold Brew Glasses Set"], "product_desc": [], "product_price": ["30.95"]},
{"product_name": ["Espresso Roast Espresso Verismo® Pods"], "product_desc": ["Every espresso beverage we handcraft for you begins right here. Our master roasters coax the beans along, the heat taking them deep and dark—a recipe for caramelly sweetness so right it’s never been changed. The quest began in 1975 with a search for the perfect melding of beans and roast, ending months of intense experimentation later with the coffee you’re holding in your hand. A blend of beans from Latin America and Asia / Pacific, roasted the way only we can.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés."], "product_price": ["42.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Sumatra Brewed Coffee Verismo® Pods"], "product_desc": ["Like the lush Indonesian island of its origin, this spicy coffee stands alone. Full-bodied with a smooth mouthfeel, lingering flavors of dried herbs and fresh earth, and almost no acidity. Our roasters love transforming these unpredictable beans from dark coral green to tiger-orange to a rich, oily mahogany, revealing bold flavors that many of us can’t live without. Coffee from Sumatra is the foundation of our most treasured blends, and something we’ve been honored to share with you for four decades.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés."], "product_price": ["42.95"]},
{"product_name": ["Italian Roast K-Cup® Pods"], "product_desc": ["This is Starbucks quintessential dark roast—expertly crafted to bring out sweetness and intensity. It showcases the precision and skill of our roasters, who created a coffee that's slightly darker than our Espresso Roast without the smoky edge of French Roast. A great cup of coffee, it has a depth of flavor that holds its own with cream and sugar.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés."], "product_price": ["23.89"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Pike Place® Roast Brewed Coffee Verismo® Pods"], "product_desc": ["From our first store in Seattle’s Pike Place Market to our coffeehouses around the world, customers requested a freshly brewed coffee they could enjoy throughout the day. So in 2008 our master blenders and roasters created it for you, a blend so consistent and harmonious that no single characteristic dominates—or disappears. A smooth, well-rounded blend of Latin American coffees with subtly rich flavors of cocoa and toasted nuts, it’s perfect for every day.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés."], "product_price": ["42.95"]},
{"product_name": ["Guatemala Antigua Espresso Verismo® Pods"], "product_desc": ["The Antigua Valley of Guatemala is treasured for its 100-year-old farms, nutrient-rich volcanic soil and its coffee, which is the touchstone of quality. Farmers take enormous pride in traditions they've passed on for generations. As a result, the coffee you experience is rich and multidimensional, with a flavor that’s consistent, cup after cup—lemon, chocolate and soft spice notes with an elegant mouthfeel unique to this region. It’s why we loved this coffee back in ’71, and why we love it today. ", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés."], "product_price": ["42.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Kenya Espresso Verismo® Pods"], "product_desc": ["Kenya’s high altitudes, ideal climate and strong traditions have helped place premium Kenyan coffees like this one among the world’s most treasured. And as it did when we introduced it in 1971, Kenya continues to astound our expert tasters and customers alike with flavors not commonly ascribed to coffee. Bright with a juicy acidity, low wine notes and fruity flavors—ranging from black currant and blackberry to tart grapefruit—that become more pronounced as the coffee cools.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés."], "product_price": ["42.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Decaf Pike Place® Roast Brewed Coffee Verismo® Pods"], "product_desc": ["From our first store in Seattle’s Pike Place Market to our coffeehouses around the world, customers requested a freshly brewed coffee they could enjoy throughout the day. So in 2008 our master blenders and roasters created it for you, a blend so consistent and harmonious that no single characteristic dominates—or disappears. A smooth, well-rounded blend of Latin American coffees with subtly rich flavors of cocoa and toasted nuts, it’s perfect for every day.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés."], "product_price": ["42.95"]},
{"product_name": ["Caffè Latte Verismo® Pods"], "product_desc": ["Use the power of your Verismo", " System to craft a creamy Starbucks", " latte. Our recipe is simple and delicious: 100% ", " coffee pods deliver an exceptional shot of espresso, and milk powder pods create velvety milk so you can enjoy a 2% milk fat latte at the push of a button.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés.", "INGREDIENTS: DRY WHOLE MILK (30% MILK FAT), GROUND COFFEE."], "product_price": ["45.95"]},
{"product_name": ["Colombia Brewed Coffee Verismo® Pods"], "product_desc": ["We’ve always loved coffee from Colombia. And we’re never reminded of that love more than when we are traveling to visit the coffee farms. Driving treacherous dirt roads with only a sheer mountain wall to the right side—to the left nothing but air for thousands of feet. Sitting at 6,500 feet of elevation, nestled among the beautiful and distinctive Colombian countryside, these farms produce the very best of this amazing coffee. For us the round body, juicy taste and signature nutty finish are worth the journey every single time.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés."], "product_price": ["42.95"]},
{"product_name": ["Verismo® White Chocolate Mocha Kit"], "product_desc": ["Start your white chocolate mocha by brewing an Espresso Roast Verismo", " Pod, top with white chocolate sauce, give it a stir and enjoy. We suggest using the Verismo", " Milk Frother, and your milk of choice to make the most authentic mochas at home."], "product_price": ["33.90"]},
{"product_name": ["Sumatra Brewed Coffee Verismo® Pods"], "product_desc": ["Like the lush Indonesian island of its origin, this spicy coffee stands alone. Full-bodied with a smooth mouthfeel, lingering flavors of dried herbs and fresh earth, and almost no acidity. Our roasters love transforming these unpredictable beans from dark coral green to tiger-orange to a rich, oily mahogany, revealing bold flavors that many of us can’t live without. Coffee from Sumatra is the foundation of our most treasured blends, and something we’ve been honored to share with you for four decades.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés."], "product_price": ["79.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Cold Brew Starter Set"], "product_desc": [], "product_price": ["35.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Guatemala Antigua Espresso Verismo® Pods"], "product_desc": ["The Antigua Valley of Guatemala is treasured for its 100-year-old farms, nutrient-rich volcanic soil and its coffee, which is the touchstone of quality. Farmers take enormous pride in traditions they've passed on for generations. As a result, the coffee you experience is rich and multidimensional, with a flavor that’s consistent, cup after cup—lemon, chocolate and soft spice notes with an elegant mouthfeel unique to this region. It’s why we loved this coffee back in ’71, and why we love it today. ", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés."], "product_price": ["79.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Kenya Espresso Verismo® Pods"], "product_desc": ["Kenya’s high altitudes, ideal climate and strong traditions have helped place premium Kenyan coffees like this one among the world’s most treasured. And as it did when we introduced it in 1971, Kenya continues to astound our expert tasters and customers alike with flavors not commonly ascribed to coffee. Bright with a juicy acidity, low wine notes and fruity flavors—ranging from black currant and blackberry to tart grapefruit—that become more pronounced as the coffee cools.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés."], "product_price": ["79.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Colombia Brewed Coffee Verismo® Pods"], "product_desc": ["We’ve always loved coffee from Colombia. And we’re never reminded of that love more than when we are traveling to visit the coffee farms. Driving treacherous dirt roads with only a sheer mountain wall to the right side—to the left nothing but air for thousands of feet. Sitting at 6,500 feet of elevation, nestled among the beautiful and distinctive Colombian countryside, these farms produce the very best of this amazing coffee. For us the round body, juicy taste and signature nutty finish are worth the journey every single time.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés."], "product_price": ["79.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Caffè Latte Verismo® Pods"], "product_desc": ["Use the power of your Verismo", " System to craft a creamy Starbucks", " latte. Our recipe is simple and delicious: 100% ", " coffee pods deliver an exceptional shot of espresso, and milk powder pods create velvety milk so you can enjoy a 2% milk fat latte at the push of a button.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés.", "INGREDIENTS: DRY WHOLE MILK (30% MILK FAT), GROUND COFFEE."], "product_price": ["86.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Veranda Blend® Brewed Coffee Verismo® Pods"], "product_desc": ["In Latin America, coffee farms are often run by families, with their own homes on the same land where their coffee grows. We’ve sipped coffee with these farmers for decades, sitting on their verandas, overlooking the lush beauty of the coffee trees rolling out in the distance. Most times it was a lightly roasted coffee like this one. It took us more than 80 tries to get it right—mellow and flavorful with a nice softness.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés."], "product_price": ["79.95"]},
{"product_name": ["VIA® Instant Sweetened Iced Coffee"], "product_desc": ["Create the best tasting beverages with these single-serve packets. Enjoy them anytime, anywhere—in an instant.", "INGREDIENTS: CANE SUGAR, INSTANT AND MICROGROUND COFFEE."], "product_price": ["5.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["VIA® Ready Brew Italian Roast"], "product_desc": ["This is Starbucks quintessential dark roast—expertly crafted to bring out sweetness and intensity. It showcases the precision and skill of our roasters, who created a coffee that's slightly darker than our Espresso Roast without the smoky edge of French Roast. A great cup of coffee, it has a depth of flavor that holds its own with cream and sugar.", "Create the best tasting beverages with these single-serve packets. Enjoy them anytime, anywhere—in an instant."], "product_price": ["37.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["VIA® Ready Brew French Roast"], "product_desc": ["Muted with oil, the tumbling beans become eerily silent. A master roaster watches, knowing that if he pushes them a second too long, they'll burst into flame. White smoke hangs down as the glistening beans turn ebony. This is French Roast, and you can't roast it darker. Straightforward, light-bodied with low acidity, and immensely popular since 1971, our darkest roast is adored for its intense smokiness.", "Create the best tasting beverages with these single-serve packets. Enjoy them anytime, anywhere—in an instant."], "product_price": ["39.95"]},
{"product_name": ["VIA® Ready Brew Decaf Italian Roast"], "product_desc": ["This is Starbucks quintessential dark roast—expertly crafted to bring out sweetness and intensity. It showcases the precision and skill of our roasters, who created a coffee that's slightly darker than our Espresso Roast without the smoky edge of French Roast. A great cup of coffee, it has a depth of flavor that holds its own with cream and sugar.", "Create the best tasting beverages with these single-serve packets. Enjoy them anytime, anywhere—in an instant."], "product_price": ["39.95"]},
{"product_name": ["VIA® Ready Brew Colombia"], "product_desc": ["We’ve always loved coffee from Colombia. And we’re never reminded of that love more than when we are traveling to visit the coffee farms. Driving treacherous dirt roads with only a sheer mountain wall to the right side—to the left nothing but air for thousands of feet. Sitting at 6,500 feet of elevation, nestled among the beautiful and distinctive Colombian countryside, these farms produce the very best of this amazing coffee. For us the round body, juicy taste and signature nutty finish are worth the journey every single time.", "Create the best tasting beverages with these single-serve packets. Enjoy them anytime, anywhere—in an instant."], "product_price": ["37.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["VIA® Instant Caramel Flavored Iced Coffee"], "product_desc": ["Create the best tasting beverages with these single-serve packets. Enjoy them anytime, anywhere—in an instant.", "INGREDIENTS: CANE SUGAR, INSTANT AND MICROGROUND COFFEE, NATURAL FLAVORS, SALT."], "product_price": ["6.95"]},
{"product_name": ["VIA® Instant Caffè Mocha Latte"], "product_desc": ["Create the best tasting beverages with these single-serve packets. Enjoy them anytime, anywhere—in an instant.", "NGREDIENTS: DAIRY POWDER, SUGAR, COCOA, COCOA PROCESSED WITH ALKALI, INSTANT AND MICROGROUND ", " COFFEE, SALT, NATURAL FLAVORS.", "CONTAINS MILK."], "product_price": ["6.95"]},
{"product_name": ["VIA® Veranda Blend®"], "product_desc": ["In Latin America, coffee farms are often run by families, with their own homes on the same land where their coffee grows. We’ve sipped coffee with these farmers for decades, sitting on their verandas, overlooking the lush beauty of the coffee trees rolling out in the distance. Most times it was a lightly roasted coffee like this one. It took us more than 80 tries to get it right—mellow and flavorful with a nice softness.", "Create the best tasting beverages with these single-serve packets. Enjoy them anytime, anywhere—in an instant."], "product_price": ["37.95"]},
{"product_name": ["VIA® Instant White Chocolate Mocha Latte"], "product_desc": ["Create the best tasting beverages with these single-serve packets. Enjoy them anytime, anywhere—in an instant.", "INGREDIENTS: SUGAR, DAIRY POWDER, INSTANT AND MICROGROUND COFFEE, NATURAL FLAVORS, SALT.", "CONTAINS MILK."], "product_price": ["6.95"]},
{"product_name": ["VIA® Ready Brew Italian Roast"], "product_desc": ["This is Starbucks quintessential dark roast—expertly crafted to bring out sweetness and intensity. It showcases the precision and skill of our roasters, who created a coffee that's slightly darker than our Espresso Roast without the smoky edge of French Roast. A great cup of coffee, it has a depth of flavor that holds its own with cream and sugar.", "Create the best tasting beverages with these single-serve packets. Enjoy them anytime, anywhere—in an instant."], "product_price": ["9.95"]},
{"product_name": ["VIA® Ready Brew Decaf Italian Roast"], "product_desc": ["This is Starbucks quintessential dark roast—expertly crafted to bring out sweetness and intensity. It showcases the precision and skill of our roasters, who created a coffee that's slightly darker than our Espresso Roast without the smoky edge of French Roast. A great cup of coffee, it has a depth of flavor that holds its own with cream and sugar.", "Create the best tasting beverages with these single-serve packets. Enjoy them anytime, anywhere—in an instant."], "product_price": ["10.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Vanilla Latte On the Go Bundle"], "product_desc": [], "product_price": ["25.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Pike Place® Roast"], "product_desc": ["From our first store in Seattle’s Pike Place Market to our coffeehouses around the world, customers requested a freshly brewed coffee they could enjoy throughout the day. So in 2008 our master blenders and roasters created it for you, a blend so consistent and harmonious that no single characteristic dominates—or disappears. A smooth, well-rounded blend of Latin American coffees with subtly rich flavors of cocoa and toasted nuts, it’s perfect for every day."], "product_price": ["12.95"]},
{"product_name": ["VIA® Instant Vanilla Latte"], "product_desc": ["Create the best tasting beverages with these single-serve packets. Enjoy them anytime, anywhere—in an instant.", "INGREDIENTS: DAIRY POWDER, SUGAR, INSTANT AND MICROGROUND ", " COFFEE, NATURAL FLAVORS.", "CONTAINS MILK."], "product_price": ["6.95"]},
{"product_name": ["Chocolate Coconut Cold Brew Coffee Pitcher Packs"], "product_desc": ["Cold brew is a simple method that brews with time instead of heat for bold, cold, super-smooth coffee. Our unique flavor sachet, made with real cocoa peel, infuses your Nariño 70 cold brew coffee with rich notes of milk chocolate and toasted coconut. Using your favorite 48 fl oz (or larger) pitcher, simply add cold water and steep two pitcher packs and one flavor sachet in the fridge for 24 hours for cold brew coffee you can enjoy all week. You can also customize with milk or sugar to bring out even more flavor.", "Receive two pitcher packs and one flavor sachet, which together make six 8 fl oz servings.", "FLAVOR SACHET INGREDIENTS: NATURAL FLAVORS, DRIED COCOA PEELS."], "product_price": ["6.95"]},
{"product_name": ["Espresso Roast"], "product_desc": ["Every espresso beverage we handcraft for you begins right here. Our master roasters coax the beans along, the heat taking them deep and dark—a recipe for caramelly sweetness so right it’s never been changed. The quest began in 1975 with a search for the perfect melding of beans and roast, ending months of intense experimentation later with the coffee you’re holding in your hand. A blend of beans from Latin America and Asia / Pacific, roasted the way only we can."], "product_price": ["12.95"]},
{"product_name": ["Guatemala Antigua"], "product_desc": ["The Antigua Valley of Guatemala is treasured for its 100-year-old farms, nutrient-rich volcanic soil and its coffee, which is the touchstone of quality. Farmers take enormous pride in traditions they've passed on for generations. As a result, the coffee you experience is rich and multidimensional, with a flavor that’s consistent, cup after cup—lemon, chocolate and soft spice notes with an elegant mouthfeel unique to this region. It’s why we loved this coffee back in ’71, and why we love it today. "], "product_price": ["13.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Italian Roast"], "product_desc": ["This is Starbucks quintessential dark roast—expertly crafted to bring out sweetness and intensity. It showcases the precision and skill of our roasters, who created a coffee that's slightly darker than our Espresso Roast without the smoky edge of French Roast. A great cup of coffee, it has a depth of flavor that holds its own with cream and sugar."], "product_price": ["12.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Kenya"], "product_desc": ["Kenya’s high altitudes, ideal climate and strong traditions have helped place premium Kenyan coffees like this one among the world’s most treasured. And as it did when we introduced it in 1971, Kenya continues to astound our expert tasters and customers alike with flavors not commonly ascribed to coffee. Bright with a juicy acidity, low wine notes and fruity flavors—ranging from black currant and blackberry to tart grapefruit—that become more pronounced as the coffee cools."], "product_price": ["13.95"]},
{"product_name": ["Sumatra"], "product_desc": ["Like the lush Indonesian island of its origin, this spicy coffee stands alone. Full-bodied with a smooth mouthfeel, lingering flavors of dried herbs and fresh earth, and almost no acidity. Our roasters love transforming these unpredictable beans from dark coral green to tiger-orange to a rich, oily mahogany, revealing bold flavors that many of us can’t live without. Coffee from Sumatra is the foundation of our most treasured blends, and something we’ve been honored to share with you for four decades."], "product_price": ["13.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Gold Coast Blend®"], "product_desc": ["This is a serious cup. Big. Bold. Syrupy, complex and refined. A coffee that means Chicago to us. When we opened our first stores there in 1987, we wanted to introduce a blend that would honor the city, and this is it. Our master coffee blenders brought together the heft of beans from Latin America and Indonesia with a bit of roasty sweetness from our dark Italian Roast. Creating a taste every bit as sophisticated as the neighborhood we named it after. And hearty enough to go up against the famously bitter winters."], "product_price": ["12.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Caffè Verona®"], "product_desc": ["This is a coffee of one true love, and three names. We created it just for a Seattle restaurant in 1975, naming it Jake’s Blend. And people loved it. So many, in fact, that we began hand scooping and blending it to order in our stores, where it was known as 80/20 Blend, for the recipe. The love was so strong we finally made it official, calling it Verona after the city that inspires so many. By any name, this is a thing of pure romance."], "product_price": ["12.95"]},
{"product_name": ["Komodo Dragon® Blend"], "product_desc": ["Deep, untamed flavors ripple through. Earthy, herbal and complex with a lingering spice. The scent is like a stroll through the forest just after a rain. This is the essence of coffees from Indonesia, and no other beans bring these flavors. Our master coffee blenders have done something remarkable. Knitting together the best pieces of the region's coffees perfectly—allowing each taste to shine through clearly. It is an experience that would otherwise never exist. And is as extraordinary and wild as its namesake."], "product_price": ["13.95"]},
{"product_name": ["Breakfast Blend"], "product_desc": ["We introduced this blend in 1998 for those who prefer a milder cup. A shade lighter than most of our offerings—more toasty than roasty—it was the result of playing with roast and taste profile together for a flavor that appealed to a wider range of palates. Perfect if you want to wake up to a less intense coffee but still want a lot of character, it's lively with a citrusy tang that gives way to a clean finish."], "product_price": ["12.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["House Blend"], "product_desc": ["It’s deceptively simple. A blend of fine Latin American beans roasted to a glistening, dark chestnut color. Loaded with flavor, balancing tastes of nut and cocoa, just a touch of sweetness from the roast. This coffee is our beginning, the very first blend we ever created for you back in 1971. And this one blend set the course for the way our master blenders and roasters work even today. A true reflection of us and a delicious cup of coffee, period. It all starts from here."], "product_price": ["12.95"]},
{"product_name": ["Dark Roast Coffee Variety Pack"], "product_desc": ["Discover deep flavor with these three bold and full-bodied Starbucks", " Dark Roast coffees. It takes just the right temperature and amount of time during the roasting process to bring our signature Starbucks", " Dark Roast coffees to their peak of aroma, acidity, body and flavor. The result is worth it: enjoy rich, well-balanced Starbucks", " Caffè Verona", ", bold and refined Starbucks", " Gold Coast Blend", ", and intensely flavorful Starbucks", " Italian Roast.", "This is a one-time delivery of three 1 lb bags of coffee."], "product_price": ["36.95"]},
{"product_name": ["Willow Blend®"], "product_desc": ["Can a blonde roast coffee be complex? We gently roasted this blend from Latin America and East Africa to create a full flavor that's surprisingly layered. The lighter roast reveals the juicy lemony notes we love to discover in African coffee, followed by a crisp finish courtesy of the Latin American beans. Graceful with a deep, enveloping flavor, it's everything you'd want from a light roast—and much more than you'd expect."], "product_price": ["12.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Organic Yukon Blend®"], "product_desc": ["Named after the North American wilderness, Organic Yukon Blend", " is a bold coffee for the adventurous at heart. Lively acidity and deep, earthy notes meld together in this classic blend. When you taste it, you get the balance and brightness of Latin American coffees along with the heft and the lingering herbal spiciness from Sumatran beans. Hearty, rugged and untamed—simply a great coffee."], "product_price": ["13.95"]},
{"product_name": ["Perugia Blend™"], "product_desc": ["Begin experiencing this full-bodied, smooth blend by inhaling its wonderfully heady aroma. Then take that first delightful sip. Perugia Blend", " satisfies your search for the very essence of rich, medium-roast flavor. That's why it's also our choice Torrefazione Italia", " coffee blend for espresso and espresso drinks."], "product_price": ["8.95"]},
{"product_name": ["Chocolate Coconut Cold Brew Coffee Pitcher Packs"], "product_desc": ["Cold brew is a simple method that brews with time instead of heat for bold, cold, super-smooth coffee. Our unique flavor sachet, made with real cocoa peel, infuses your Nariño 70 cold brew coffee with rich notes of milk chocolate and toasted coconut. Using your favorite 48 fl oz (or larger) pitcher, simply add cold water and steep two pitcher packs and one flavor sachet in the fridge for 24 hours for cold brew coffee you can enjoy all week. You can also customize with milk or sugar to bring out even more flavor.", "Receive two pitcher packs and one flavor sachet, which together make six 8 fl oz servings.", "FLAVOR SACHET INGREDIENTS: NATURAL FLAVORS, DRIED COCOA PEELS."], "product_price": ["6.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Nariño 70 Cold Brew Coffee"], "product_desc": ["Cold brew is a simple method that brews with time instead of heat for bold, cold, super-smooth coffee. Using your favorite 48 fl oz (or larger) pitcher, simply add cold water and steep two pitcher packs in the fridge for 24 hours for cold brew coffee you can enjoy for up to a week.", "Receive four pitcher packs, which together make twelve 8 fl oz servings."], "product_price": ["11.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Espresso Roast"], "product_desc": ["Every espresso beverage we handcraft for you begins right here. Our master roasters coax the beans along, the heat taking them deep and dark—a recipe for caramelly sweetness so right it’s never been changed. The quest began in 1975 with a search for the perfect melding of beans and roast, ending months of intense experimentation later with the coffee you’re holding in your hand. A blend of beans from Latin America and Asia / Pacific, roasted the way only we can."], "product_price": ["12.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Vanilla Cold Brew Set"], "product_desc": [], "product_price": ["40.95"]},
{"product_name": ["Kenya"], "product_desc": ["Kenya’s high altitudes, ideal climate and strong traditions have helped place premium Kenyan coffees like this one among the world’s most treasured. And as it did when we introduced it in 1971, Kenya continues to astound our expert tasters and customers alike with flavors not commonly ascribed to coffee. Bright with a juicy acidity, low wine notes and fruity flavors—ranging from black currant and blackberry to tart grapefruit—that become more pronounced as the coffee cools."], "product_price": ["13.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Pike Place® Roast"], "product_desc": ["From our first store in Seattle’s Pike Place Market to our coffeehouses around the world, customers requested a freshly brewed coffee they could enjoy throughout the day. So in 2008 our master blenders and roasters created it for you, a blend so consistent and harmonious that no single characteristic dominates—or disappears. A smooth, well-rounded blend of Latin American coffees with subtly rich flavors of cocoa and toasted nuts, it’s perfect for every day."], "product_price": ["12.95"]},
{"product_name": ["Cold Brew Glasses Set"], "product_desc": [], "product_price": ["30.95"]},
{"product_name": ["Guatemala Antigua"], "product_desc": ["The Antigua Valley of Guatemala is treasured for its 100-year-old farms, nutrient-rich volcanic soil and its coffee, which is the touchstone of quality. Farmers take enormous pride in traditions they've passed on for generations. As a result, the coffee you experience is rich and multidimensional, with a flavor that’s consistent, cup after cup—lemon, chocolate and soft spice notes with an elegant mouthfeel unique to this region. It’s why we loved this coffee back in ’71, and why we love it today. "], "product_price": ["13.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Komodo Dragon® Blend"], "product_desc": ["Deep, untamed flavors ripple through. Earthy, herbal and complex with a lingering spice. The scent is like a stroll through the forest just after a rain. This is the essence of coffees from Indonesia, and no other beans bring these flavors. Our master coffee blenders have done something remarkable. Knitting together the best pieces of the region's coffees perfectly—allowing each taste to shine through clearly. It is an experience that would otherwise never exist. And is as extraordinary and wild as its namesake."], "product_price": ["13.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Pike Place® Roast"], "product_desc": ["From our first store in Seattle’s Pike Place Market to our coffeehouses around the world, customers requested a freshly brewed coffee they could enjoy throughout the day. So in 2008 our master blenders and roasters created it for you, a blend so consistent and harmonious that no single characteristic dominates—or disappears. A smooth, well-rounded blend of Latin American coffees with subtly rich flavors of cocoa and toasted nuts, it’s perfect for every day."], "product_price": ["12.95"]},
{"product_name": ["Veranda Blend®"], "product_desc": ["In Latin America, coffee farms are often run by families, with their own homes on the same land where their coffee grows. We’ve sipped coffee with these farmers for decades, sitting on their verandas, overlooking the lush beauty of the coffee trees rolling out in the distance. Most times it was a lightly roasted coffee like this one. It took us more than 80 tries to get it right—mellow and flavorful with a nice softness."], "product_price": ["12.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Sumatra"], "product_desc": ["Like the lush Indonesian island of its origin, this spicy coffee stands alone. Full-bodied with a smooth mouthfeel, lingering flavors of dried herbs and fresh earth, and almost no acidity. Our roasters love transforming these unpredictable beans from dark coral green to tiger-orange to a rich, oily mahogany, revealing bold flavors that many of us can’t live without. Coffee from Sumatra is the foundation of our most treasured blends, and something we’ve been honored to share with you for four decades."], "product_price": ["13.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Pike Place® Roast K-Cup® Pods"], "product_desc": ["From our first store in Seattle’s Pike Place Market to our coffeehouses around the world, customers requested a freshly brewed coffee they could enjoy throughout the day. So in 2008 our master blenders and roasters created it for you, a blend so consistent and harmonious that no single characteristic dominates—or disappears. A smooth, well-rounded blend of Latin American coffees with subtly rich flavors of cocoa and toasted nuts, it’s perfect for every day.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés."], "product_price": ["16.99"]},
{"product_name": ["Decaf Caffè Verona®"], "product_desc": ["This is a coffee of one true love, and three names. We created it just for a Seattle restaurant in 1975, naming it Jake’s Blend. And people loved it. So many, in fact, that we began hand scooping and blending it to order in our stores, where it was known as 80/20 Blend, for the recipe. The love was so strong we finally made it official, calling it Verona after the city that inspires so many. By any name, this is a thing of pure romance."], "product_price": ["13.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Caramel Caffè Latte K-Cup® Pods"], "product_desc": ["Now you can enjoy café-style caramel lattes at home with your Keurig", " brewer. Indulge in the creamy bliss of dairy and caramel flavor specially crafted to complement our smooth, balanced Caffè Blend made from 100% ", " coffee. Every cup you make on your Keurig", " brewer will taste velvety rich and deliciously familiar.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés.", "CAFFÈ BLEND K-CUP", " POD INGREDIENTS: GROUND COFFEE.", "SWEETENED DAIRY PACKET INGREDIENTS: SUGAR, NONFAT DRY MILK, DRIED CREAM, NATURAL FLAVORS.", "CONTAINS MILK."], "product_price": ["11.99"]},
{"product_name": ["Breakfast Blend K-Cup® Pods"], "product_desc": ["We introduced this blend in 1998 for those who prefer a milder cup. A shade lighter than most of our offerings—more toasty than roasty—it was the result of playing with roast and taste profile together for a flavor that appealed to a wider range of palates. Perfect if you want to wake up to a less intense coffee but still want a lot of character, it's lively with a citrusy tang that gives way to a clean finish.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés."], "product_price": ["16.99"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Classic Hot Cocoa K-Cup® Pods"], "product_desc": ["An indulgent favorite inspired by Starbucks", " handcrafted hot chocolate. Created specifically for your Keurig", " machine, our Classic Hot Cocoa delivers a rich and creamy way to treat yourself, sip after satisfying sip.", "Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods come in flavors to fit any occasion.", "INGREDIENTS: SUGAR, ALKALIZED COCOA POWDER, COCONUT OIL, NONFAT DRY MILK, WHEY SOLIDS, SEA SALT, COCOA EXTRACT, SODIUM CASEINATE, NATURAL FLAVOR, DIPOTASSIUM PHOSPHATE, MONO- AND DIGLYCERIDES, STEVIOL GLYCOSIDES.", "CONTAINS MILK."], "product_price": ["12.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Vanilla Caffè Latte K-Cup® Pods"], "product_desc": ["Now you can enjoy café-style vanilla lattes at home with your Keurig", " brewer. Enjoy the sweet creaminess of dairy and vanilla flavor specially crafted to complement our smooth, balanced Caffè Blend made from 100% ", " coffee. Every cup you make on your Keurig", " brewer will taste velvety rich and deliciously familiar.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés.", "CAFFÈ BLEND K-CUP", " POD INGREDIENTS: GROUND COFFEE.", "SWEETENED DAIRY PACKET INGREDIENTS: SUGAR, NONFAT DRY MILK, DRIED CREAM, NATURAL FLAVORS.", "CONTAINS MILK."], "product_price": ["11.99"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Pike Place® Roast K-Cup® Pods"], "product_desc": ["From our first store in Seattle’s Pike Place Market to our coffeehouses around the world, customers requested a freshly brewed coffee they could enjoy throughout the day. So in 2008 our master blenders and roasters created it for you, a blend so consistent and harmonious that no single characteristic dominates—or disappears. A smooth, well-rounded blend of Latin American coffees with subtly rich flavors of cocoa and toasted nuts, it’s perfect for every day.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés."], "product_price": ["49.99"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Decaf House Blend K-Cup® Pods"], "product_desc": ["It’s deceptively simple. A blend of fine Latin American beans roasted to a glistening, dark chestnut color. Loaded with flavor, balancing tastes of nut and cocoa, just a touch of sweetness from the roast. This coffee is our beginning, the very first blend we ever created for you back in 1971. And this one blend set the course for the way our master blenders and roasters work even today. A true reflection of us and a delicious cup of coffee, period. It all starts from here.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés."], "product_price": ["23.89"]},
{"product_name": ["Cinnamon Dolce K-Cup® Pods"], "product_desc": ["Dolce is Italian for \"sweet,\" and this Blonde-roasted coffee is aptly-named. Notes of cinnamon, butter and brown sugar evoke handcrafted desserts—flavors that are nicely balanced by the mellow softness of the lighter-roasted blend.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés.", "INGREDIENTS: GROUND COFFEE, NATURAL FLAVORS."], "product_price": ["23.89"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Decaf Pike Place® Roast K-Cup® Pods"], "product_desc": ["From our first store in Seattle’s Pike Place Market to our coffeehouses around the world, customers requested a freshly brewed coffee they could enjoy throughout the day. So in 2008 our master blenders and roasters created it for you, a blend so consistent and harmonious that no single characteristic dominates—or disappears. A smooth, well-rounded blend of Latin American coffees with subtly rich flavors of cocoa and toasted nuts, it’s perfect for every day.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés."], "product_price": ["16.99"]},
{"product_name": ["French Roast K-Cup® Pods"], "product_desc": ["Muted with oil, the tumbling beans become eerily silent. A master roaster watches, knowing that if he pushes them a second too long, they'll burst into flame. White smoke hangs down as the glistening beans turn ebony. This is French Roast, and you can't roast it darker. Straightforward, light-bodied with low acidity, and immensely popular since 1971, our darkest roast is adored for its intense smokiness.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés."], "product_price": ["49.99"]},
{"product_name": ["Sumatra K-Cup® Pods"], "product_desc": ["Like the lush Indonesian island of its origin, this spicy coffee stands alone. Full-bodied with a smooth mouthfeel, lingering flavors of dried herbs and fresh earth, and almost no acidity. Our roasters love transforming these unpredictable beans from dark coral green to tiger-orange to a rich, oily mahogany, revealing bold flavors that many of us can’t live without. Coffee from Sumatra is the foundation of our most treasured blends, and something we’ve been honored to share with you for four decades.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés."], "product_price": ["23.89"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Vanilla K-Cup® Pods"], "product_desc": ["A generous kick of vanilla makes this coffee a deliciously satisfying treat. The recipe is an enticing blend of lighter-roasted beans and vanilla flavor that you can enjoy anytime. Add some tasty fun to your cup before brewing: ground cinnamon, brown sugar or hot chocolate mix.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés.", "INGREDIENTS: GROUND COFFEE, NATURAL FLAVORS."], "product_price": ["23.89"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Decaf Pike Place® Roast K-Cup® Pods"], "product_desc": ["From our first store in Seattle’s Pike Place Market to our coffeehouses around the world, customers requested a freshly brewed coffee they could enjoy throughout the day. So in 2008 our master blenders and roasters created it for you, a blend so consistent and harmonious that no single characteristic dominates—or disappears. A smooth, well-rounded blend of Latin American coffees with subtly rich flavors of cocoa and toasted nuts, it’s perfect for every day.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés."], "product_price": ["49.99"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["East Timor Peaberry"], "product_desc": ["Located about 400 miles off Australia’s northern coast, the mountainous island nation of Timor is dotted with tiny coffee farms. Here, in collaboration with Cooperativa Café Timor, Starbucks is proud to play a continued role in improving access to quality health care by helping fund eight medical clinics—getting thousands of co-op members and their families the medical attention they need.", "Amid difficult terrain and a lack of resources, advancements like sanitary facilities and reliable emergency communication systems change lives—and underscore the belief that healthier communities grow exceptional coffee. This peaberry lot, available exclusively from Starbucks, is a prime example: sweet, floral and extraordinary."], "product_price": ["12.50"]},
{"product_name": ["Sun-Dried Brazil Sertão"], "product_desc": ["The Sertão Estate is hailed as one of the first farms to produce coffee in Brazil’s Carmo de Minas region. Under José Isidoro Pereira and Nazareth Dias Pereira, three generations have thrived on the area’s steep, sprawling hillsides. With children and grandchildren now involved in running the farm, traditions are growing and evolving to include roasting and exporting coffee, and even sharing a coffee shop with the community.", "It’s a rich family legacy, and it culminates in a wonderfully distinctive flavor enhanced by the sun-dried method. Every cup unfolds with a bright, delicate sweetness, reflecting the deep connection between a family and the land they’ve come to know and love."], "product_price": ["17.50"]},
{"product_name": ["Veranda Blend® K-Cup® Pods"], "product_desc": ["In Latin America, coffee farms are often run by families, with their own homes on the same land where their coffee grows. We’ve sipped coffee with these farmers for decades, sitting on their verandas, overlooking the lush beauty of the coffee trees rolling out in the distance. Most times it was a lightly roasted coffee like this one. It took us more than 80 tries to get it right—mellow and flavorful with a nice softness.", "Bring home rich, full flavor in every cup. Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods are made with the same coffee brewed in Starbucks", " cafés."], "product_price": ["49.99"]},
{"product_name": ["Cold Brew Kit"], "product_desc": [], "product_price": ["24.95"]},
{"product_name": ["Hawaii Ka'u"], "product_desc": ["Sea turtles were basking in the sun and nesting on this land long before it was given the name Ka`u. Today, life in this sparsely populated part of Hawaii continues to be slow-paced. With the high elevation and cool nights, even the coffee cherries mature more slowly in Ka`u. And with deep, nutrient-rich volcanic soil, these farms are producing coffees coveted around the world for their distinctive sweetness. This coffee is a simple way to joyfully share life—the spirit of Aloha."], "product_price": ["24.50"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Panama Carmen Estate"], "product_desc": ["Carlos Aguilera produces some of the world’s most celebrated specialty coffees on his family’s award-winning estate. The lush microclimate is influenced by its proximity to both the Atlantic and Pacific oceans. The rich volcanic soil of the Volcán Valley combined with cool, airy nights and dry, sun-filled days culminate in a distinctive taste—sparkling and bright with pronounced floral and citrus notes. It’s a flavor reflective of the extraordinary quality that Panama Carmen Estate has become renowned for."], "product_price": ["17.50"]},
{"product_name": ["Hand Grinder"], "product_desc": [], "product_price": ["59.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["FC-100 Bonded Filters"], "product_desc": [], "product_price": ["11.95"]},
{"product_name": ["Rechargeable Coffee Scale"], "product_desc": [], "product_price": ["69.99"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Stainless Steel Coffee Press with Walnut Handle - Copper"], "product_desc": [], "product_price": ["49.95"]},
{"product_name": ["ESPRO® Press"], "product_desc": [], "product_price": ["99.95"]},
{"product_name": ["Charcoal Mug"], "product_desc": [], "product_price": ["12.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["ESPRO® Press"], "product_desc": [], "product_price": ["119.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Papua New Guinea Roots No. 1"], "product_desc": ["On the remote southwest Pacific island of Papua New Guinea, rugged coastlines give way to mountainous stretches, lush rainforests and active volcanoes. Infrastructure ranges from spotty to nonexistent, making the distance from one community to the next seem that much greater. On a landmass roughly the size of California, 800 languages are spoken, each signifying its own subculture. Faced with all of these complexities, the 400 farmers of the Roots No. 1 collective took matters into their own hands.", "They combined their backyard crops and opened their own processing mill, allowing them to strictly control every step from growing to trading. And now, thanks to their efforts, we have the opportunity to proudly introduce this lot—rich in flavors of orange, lemon and honey."], "product_price": ["14.50"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Malawi Sable Farms"], "product_desc": ["The consistently outstanding coffee coming out of Sable Farms is the result of a foundational belief: invest in the farming practices that support the environment and the people who support the farm. Southern Malawi, landlocked and hampered by a lack of infrastructure, is not an easy place to grow coffee. But these farmers pour their efforts into using their limited resources with a thoughtfulness that’s brought healthy growth and a global reputation.", "Using drip irrigation systems for precise watering, solar coffee dryers to save energy, composting, water reuse and filtering, and regular soil monitoring, their processing is the picture of environmental care. And they extend that same philosophy to the people within their coffee community."], "product_price": ["12.50"]},
{"product_name": ["Charcoal Mug"], "product_desc": [], "product_price": ["16.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Clever® Coffee Dripper"], "product_desc": [], "product_price": ["21.95"]},
{"product_name": ["French Roast Portion Packs"], "product_desc": ["Muted with oil, the tumbling beans become eerily silent. A master roaster watches, knowing that if he pushes them a second too long, they'll burst into flame. White smoke hangs down as the glistening beans turn ebony. This is French Roast, and you can't roast it darker. Straightforward, light-bodied with low acidity, and immensely popular since 1971, our darkest roast is adored for its intense smokiness.", "Each 2.5 oz portion pack of ground coffee is pre-measured to brew one pot of coffee, approximately 50-64 fl oz depending on the desired strength."], "product_price": ["42.95"]},
{"product_name": ["Decaf Pike Place® Roast Portion Packs"], "product_desc": ["From our first store in Seattle’s Pike Place Market to our coffeehouses around the world, customers requested a freshly brewed coffee they could enjoy throughout the day. So in 2008 our master blenders and roasters created it for you, a blend so consistent and harmonious that no single characteristic dominates—or disappears. A smooth, well-rounded blend of Latin American coffees with subtly rich flavors of cocoa and toasted nuts, it’s perfect for every day.", "Each 2.5 oz portion pack of ground coffee is pre-measured to brew one pot of coffee, approximately 50-64 fl oz depending on the desired strength."], "product_price": ["42.95"]},
{"product_name": ["Pike Place® Roast Portion Packs"], "product_desc": ["From our first store in Seattle’s Pike Place Market to our coffeehouses around the world, customers requested a freshly brewed coffee they could enjoy throughout the day. So in 2008 our master blenders and roasters created it for you, a blend so consistent and harmonious that no single characteristic dominates—or disappears. A smooth, well-rounded blend of Latin American coffees with subtly rich flavors of cocoa and toasted nuts, it’s perfect for every day.", "Each 2.5 oz portion pack of ground coffee is pre-measured to brew one pot of coffee, approximately 50-64 fl oz depending on the desired strength."], "product_price": ["42.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Sumatra Portion Packs"], "product_desc": ["Like the lush Indonesian island of its origin, this spicy coffee stands alone. Full-bodied with a smooth mouthfeel, lingering flavors of dried herbs and fresh earth, and almost no acidity. Our roasters love transforming these unpredictable beans from dark coral green to tiger-orange to a rich, oily mahogany, revealing bold flavors that many of us can’t live without. Coffee from Sumatra is the foundation of our most treasured blends, and something we’ve been honored to share with you for four decades.", "Each 2.5 oz portion pack of ground coffee is pre-measured to brew one pot of coffee, approximately 50-64 fl oz depending on the desired strength."], "product_price": ["42.95"]},
{"product_name": ["Caffè Verona® Portion Packs"], "product_desc": ["This is a coffee of one true love, and three names. We created it just for a Seattle restaurant in 1975, naming it Jake’s Blend. And people loved it. So many, in fact, that we began hand scooping and blending it to order in our stores, where it was known as 80/20 Blend, for the recipe. The love was so strong we finally made it official, calling it Verona after the city that inspires so many. By any name, this is a thing of pure romance.", "Each 2.5 oz portion pack of ground coffee is pre-measured to brew one pot of coffee, approximately 50-64 fl oz depending on the desired strength."], "product_price": ["42.95"]},
{"product_name": ["Vanilla Caramel Chai Tea Latte Concentrate"], "product_desc": ["Cinnamon sticks gather on a lush black-tea lawn for a leisurely afternoon of croquet and conversation. Ginger offers to keep score from the sidelines while handing out elegantly wrapped vanilla caramels and crystal goblets of milk.", "INGREDIENTS: AN INFUSION OF (WATER, BLACK TEA, BLACK PEPPER, GINGER, CARDAMOM, CINNAMON, CLOVES, STAR ANISE, NATURAL FLAVORS), CANE SUGAR, HONEY, NATURAL FLAVORS, GINGER JUICE, VANILLA EXTRACT, CITRIC ACID."], "product_price": ["5.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Organic Chai Filterbag Tea"], "product_desc": ["You are a spicy one, aren't you? Like a drive through an exotic marketplace with the windows rolled down, this blend of black teas will fill your senses, while the sweet cinnamon, spicy ginger and fragrant cardamom flirtatiously grab the steering wheel to take you in another direction.", "INGREDIENTS: BLACK TEAS, GINGER, CINNAMON, BLACK PEPPER, CARDAMOM, CLOVES, STAR ANISE, ORGANICALLY GROWN."], "product_price": ["4.95"]},
{"product_name": ["Masala Chai Tea Verismo® Pods"], "product_desc": ["With the touch of a button, enjoy the bold spice notes of this sweetened black tea. Or blend with fresh frothed milk or a Verismo", " milk pod for a velvety Chai Latte. It’s a sensory voyage without leaving the coziness of home.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés.", "INGREDIENTS: SUGAR, INSTANT TEA POWDER, NATURAL FLAVOR."], "product_price": ["42.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Chai Tea Latte Concentrate"], "product_desc": ["You are a spicy one, aren't you? Like a drive through an exotic marketplace with the windows rolled down, this blend of black teas will fill your senses, while the sweet cinnamon, spicy ginger and fragrant cardamom flirtatiously grab the steering wheel to take you in another direction.", "INGREDIENTS: AN INFUSION OF (WATER, BLACK TEA, BLACK PEPPER, GINGER, CARDAMOM, CINNAMON, CLOVES, STAR ANISE, NATURAL FLAVORS), CANE SUGAR, HONEY, GINGER JUICE, NATURAL FLAVORS, VANILLA EXTRACT, CITRIC ACID."], "product_price": ["4.95"]},
{"product_name": ["Organic Chai Full-Leaf Sachets"], "product_desc": ["This organic blend of traditional chai spices and bold black tea warms the palate with ginger, pepper, cardamom, cloves and the natural sweetness of cinnamon.", "Selecting from the world's top teas and botanicals, Teavana", " master blenders craft teas to infuse every day with brilliance.", "INGREDIENTS: BLACK TEA*, GINGER*, CINNAMON*, CARDAMOM*, BLACK PEPPER*, STAR ANISE*, CLOVES*, CARDAMOM ESSENCE. *ORGANIC"], "product_price": ["8.95"]},
{"product_name": ["Iced Black Filterbag Tea"], "product_desc": ["Go for the high dive. Certain feats, like executing a reverse swan dive into a shimmering pool while wearing a pair of Euro-cut trunks and a captain's hat, ought only be attempted by a select few. This blend of black teas has the kind of cool, smooth sophistication to pull off a move like that, should it choose to do so.", "INGREDIENTS: A BLEND OF BLACK TEAS."], "product_price": ["24.95"]},
{"product_name": ["Masala Chai Tea Verismo® Pods"], "product_desc": ["With the touch of a button, enjoy the bold spice notes of this sweetened black tea. Or blend with fresh frothed milk or a Verismo", " milk pod for a velvety Chai Latte. It’s a sensory voyage without leaving the coziness of home.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés.", "INGREDIENTS: SUGAR, INSTANT TEA POWDER, NATURAL FLAVOR."], "product_price": ["11.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Earl Grey Filterbag Tea"], "product_desc": ["If you lose your way, look for the bergamot sun. A ship packed with crates of fragrant black teas heeled through inky waters toward the clearing of the bergamot sun in search of the Isle of Lavender—to forever soften this headstrong blend with floral notes.", "INGREDIENTS: BLACK TEAS BLENDED WITH THE ESSENCE OF BERGAMOT."], "product_price": ["4.95"]},
{"product_name": ["Iced Blushberry Black™ Filterbag Tea"], "product_desc": ["Black teas sit lounging poolside when three ripe summer berries check in, slip into their swimsuits and twirl synchronized somersaults under water. Resurfacing refreshed, they blush at their scores: perfect 10s.", "Each filterbag makes 2 quarts of iced tea.", "INGREDIENTS: BLACK TEAS, LICORICE ROOT, NATURAL FLAVORS, HIBISCUS."], "product_price": ["4.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Masala Chai Tea Verismo® Pods"], "product_desc": ["With the touch of a button, enjoy the bold spice notes of this sweetened black tea. Or blend with fresh frothed milk or a Verismo", " milk pod for a velvety Chai Latte. It’s a sensory voyage without leaving the coziness of home.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés.", "INGREDIENTS: SUGAR, INSTANT TEA POWDER, NATURAL FLAVOR."], "product_price": ["11.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Vanilla Caramel Chai Tea Latte Concentrate"], "product_desc": ["Cinnamon sticks gather on a lush black-tea lawn for a leisurely afternoon of croquet and conversation. Ginger offers to keep score from the sidelines while handing out elegantly wrapped vanilla caramels and crystal goblets of milk.", "INGREDIENTS: AN INFUSION OF (WATER, BLACK TEA, BLACK PEPPER, GINGER, CARDAMOM, CINNAMON, CLOVES, STAR ANISE, NATURAL FLAVORS), CANE SUGAR, HONEY, NATURAL FLAVORS, GINGER JUICE, VANILLA EXTRACT, CITRIC ACID."], "product_price": ["5.95"]},
{"product_name": ["Organic Chai Full-Leaf Sachets"], "product_desc": ["This organic blend of traditional chai spices and bold black tea warms the palate with ginger, pepper, cardamom, cloves and the natural sweetness of cinnamon.", "Selecting from the world's top teas and botanicals, Teavana", " master blenders craft teas to infuse every day with brilliance.", "INGREDIENTS: BLACK TEA*, GINGER*, CINNAMON*, CARDAMOM*, BLACK PEPPER*, STAR ANISE*, CLOVES*, CARDAMOM ESSENCE. *ORGANIC"], "product_price": ["8.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Awake™ English Breakfast K-Cup® Pods"], "product_desc": ["The sun peeks over the horizon, a star streaks the sky and the world begins anew. This bold and flavorful blend of black teas will send you down the day's path wondering where it will take you and whether to bring a friend.", "Designed for use in all Keurig", " K-Cup", " brewers, these single-serve pods come in flavors to fit any occasion.", "INGREDIENTS: A BLEND OF BLACK TEAS."], "product_price": ["95.59"]},
{"product_name": ["Berry Trifle Full Leaf Tea"], "product_desc": ["Ripe strawberry, blueberry and raspberry dart back and forth in a friendly game of tag. Black tea joins them, and is caught up in the sweet-smelling breeze whirling by.", "INGREDIENTS: A BLEND OF BLACK TEAS, FREEZE-DRIED BERRY PIECES (STRAWBERRY, RASPBERRY, BLUEBERRY), NATURAL FLAVORS."], "product_price": ["6.99"]},
{"product_name": ["Masala Chai Tea Verismo® Pods"], "product_desc": ["With the touch of a button, enjoy the bold spice notes of this sweetened black tea. Or blend with fresh frothed milk or a Verismo", " milk pod for a velvety Chai Latte. It’s a sensory voyage without leaving the coziness of home.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés.", "INGREDIENTS: SUGAR, INSTANT TEA POWDER, NATURAL FLAVOR."], "product_price": ["42.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Iced Lemongrass Green Filterbag Tea"], "product_desc": ["Find your place in the shade. Spearmint leaves and lemon verbena engage in a lively round of croquet in the lemongrass, then retreat to the shade of green tea's cool, verdant veranda for a leisurely game of mahjong.", "Each filterbag makes 2 quarts of iced tea.", "INGREDIENTS: GREEN TEA, LEMON VERBENA LEAVES, SPEARMINT, LEMONGRASS, LEMON ESSENCE OIL."], "product_price": ["4.95"]},
{"product_name": ["Zen™ Filterbag Tea"], "product_desc": ["Find your inner green, then play at least nine holes. Through the screened front door, zingy lemongrass and spritely spearmint coax contemplative pan-fired green teas to come play. Calmly, lemon verbena opens the door and invites them all to a cup of tea.", "INGREDIENTS: GREEN TEA, LEMON VERBENA LEAVES, SPEARMINT LEAVES, LEMONGRASS, NATURAL FLAVORS."], "product_price": ["4.95"]},
{"product_name": ["Zen™ Iced Green Filterbag Tea, 24 count"], "product_desc": ["Find your place in the shade. Spearmint leaves and lemon verbena engage in a lively round of croquet in the lemongrass, then retreat to the shade of green tea's cool, verdant veranda for a leisurely game of mahjong.", "INGREDIENTS: GREEN TEA, LEMON VERBENA LEAVES, SPEARMINT LEAVES, LEMONGRASS, LEMON ESSENCE OIL."], "product_price": ["26.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["China Green Tips Filterbag Tea"], "product_desc": ["At the end of a shaded trail, will you choose the sauna or the hot spring? Linger in the pure, steam-fired broth of this first-flush green tea thinking clear, peaceful thoughts. Like watching mist rise off a thermal spring, hidden behind a wooded glen and only accessible by trampoline.", "INGREDIENTS: SPRING-HARVESTED GREEN TEAS."], "product_price": ["4.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Emperor's Clouds & Mist® Full-Leaf Sachets"], "product_desc": ["One tea bag transcends ordinary flavors with high-grown green tea, cultivated among the clouds. This tea is grown at elevations of 3,478 feet and above, among the \"clouds and mist\" that inspired its name. Once picked, the curly, silver-speckled leaves and buds are lightly toasted to achieve a gentle sweetness.", "Selecting from the world's top teas and botanicals, Teavana", " master blenders craft teas to infuse every day with brilliance.", "INGREDIENTS: GREEN TEA."], "product_price": ["8.95"]},
{"product_name": ["Gingerly Jasmine™ Full Leaf Tea"], "product_desc": ["Ginger mantras, jasmine green tea meditations, and a touch of rose come together under bamboo trees to seek enlightenment. ", "INGREDIENTS: GREEN TEA, GINGER ROOT, JASMINE GREEN TEA, ROSE PETALS, NATURAL FLAVORS."], "product_price": ["6.99"]},
{"product_name": ["Iced Peach Green Pitcher Packs"], "product_desc": ["Each artfully blended tea bag lets you brew iced green tea with a peachy sweetness and citrusy zing. Crisp, refreshing green tea has a natural sweetness when blended with juicy peach notes. Hints of lemon verbena and lemongrass add a sunny citrus finish.", "Each pitcher pack brews 64 fl oz of iced tea.", "Selecting from the world's top teas and botanicals, Teavana", " master blenders craft teas to infuse every day with brilliance.", "INGREDIENTS: GREEN TEA, LEMON VERBENA, NATURAL FLAVORS, SPEARMINT LEAVES, LICORICE ROOT, LEMONGRASS, LEMON BALM LEAVES, LEMON ESSENCE."], "product_price": ["7.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Iced Passion® Filterbag Tea"], "product_desc": ["A hot-cold summer romance to keep things interesting. Voluptuous hibiscus blossoms, perfumed with passion fruit essences, sidle up to long tall lemongrass. A forbidden fruit romance ignites, but ice cubes will quickly cool things down to a pleasant PG-rated affair.", "Each filterbag makes 2 quarts of iced tea.", "INGREDIENTS: HIBISCUS FLOWERS, NATURAL TROPICAL FLAVORS, CITRIC ACID, LICORICE ROOT, ORANGE PEEL, CINNAMON, ROSE HIPS, LEMONGRASS, FRUIT JUICE EXTRACT (COLOR)."], "product_price": ["4.95"]},
{"product_name": ["Iced Black Filterbag Tea"], "product_desc": ["Go for the high dive. Certain feats, like executing a reverse swan dive into a shimmering pool while wearing a pair of Euro-cut trunks and a captain's hat, ought only be attempted by a select few. This blend of black teas has the kind of cool, smooth sophistication to pull off a move like that, should it choose to do so.", "INGREDIENTS: A BLEND OF BLACK TEAS."], "product_price": ["24.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Acrylic Pitcher"], "product_desc": [], "product_price": ["24.95"]},
{"product_name": ["Iced Blushberry Black™ Filterbag Tea"], "product_desc": ["Black teas sit lounging poolside when three ripe summer berries check in, slip into their swimsuits and twirl synchronized somersaults under water. Resurfacing refreshed, they blush at their scores: perfect 10s.", "Each filterbag makes 2 quarts of iced tea.", "INGREDIENTS: BLACK TEAS, LICORICE ROOT, NATURAL FLAVORS, HIBISCUS."], "product_price": ["4.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Tropic Black Iced Tea Bag"], "product_desc": ["Find your place in the shade. This blend of black teas from Indonesia, Sri Lanka and India has just a hint of jasmine and tropical essences to give it that crisp flavor—just what you want in a refreshing iced tea. It goes perfectly with a hammock under a shady tree on a balmy day.", "INGREDIENTS: A BLEND OF BLACK TEAS."], "product_price": ["26.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Iced Lemongrass Green Filterbag Tea"], "product_desc": ["Find your place in the shade. Spearmint leaves and lemon verbena engage in a lively round of croquet in the lemongrass, then retreat to the shade of green tea's cool, verdant veranda for a leisurely game of mahjong.", "Each filterbag makes 2 quarts of iced tea.", "INGREDIENTS: GREEN TEA, LEMON VERBENA LEAVES, SPEARMINT, LEMONGRASS, LEMON ESSENCE OIL."], "product_price": ["4.95"]},
{"product_name": ["Berryblossom White® Filterbag Tea"], "product_desc": ["Can berry cohabitation be far behind? Can two berries become friends and even share an apartment? Why yes, because here you'll find hints of huckleberries and crisp white cranberries bantering playfully, while watching their favorite reruns, and coexisting harmoniously within the soft, silky texture of this light and delicate tea.", "INGREDIENTS: WHITE TEA, NATURAL HUCKLEBERRY FLAVOR, NATURAL CRANBERRY FLAVOR, BLACK DARJEELING TEA."], "product_price": ["4.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Ceylon Ice Tea Jug"], "product_desc": [], "product_price": ["29.95"]},
{"product_name": ["Iced Passion® Filterbag Tea"], "product_desc": ["A hot-cold summer romance to keep things interesting. Voluptuous hibiscus blossoms, perfumed with passion fruit essences, sidle up to long tall lemongrass. A forbidden fruit romance ignites, but ice cubes will quickly cool things down to a pleasant PG-rated affair.", "INGREDIENTS: HIBISCUS FLOWERS, NATURAL TROPICAL FLAVORS, CITRIC ACID, LICORICE ROOT, ORANGE PEEL, CINNAMON, ROSE HIPS, LEMONGRASS, FRUIT JUICE EXTRACT (COLOR)."], "product_price": ["26.95"]},
{"product_name": ["Iced Passion® Filterbag Tea"], "product_desc": ["A hot-cold summer romance to keep things interesting. Voluptuous hibiscus blossoms, perfumed with passion fruit essences, sidle up to long tall lemongrass. A forbidden fruit romance ignites, but ice cubes will quickly cool things down to a pleasant PG-rated affair.", "Each filterbag makes 2 quarts of iced tea.", "INGREDIENTS: HIBISCUS FLOWERS, NATURAL TROPICAL FLAVORS, CITRIC ACID, LICORICE ROOT, ORANGE PEEL, CINNAMON, ROSE HIPS, LEMONGRASS, FRUIT JUICE EXTRACT (COLOR)."], "product_price": ["4.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Passion® Filterbag Tea"], "product_desc": ["De-beige your day, one cup at a time. Tart rose hips and citrusy lemongrass woo the voluptuous blooms of hibiscus flowers. An infusion that's bursting with life and tinged with the color of true love to make sure you never have to live a day without passion.", "INGREDIENTS: HIBISCUS FLOWERS, NATURAL TROPICAL FLAVORS, CITRIC ACID, LICORICE ROOT, ORANGE PEEL, CINNAMON, ROSE HIPS, LEMONGRASS, FRUIT JUICE EXTRACT (COLOR)."], "product_price": ["4.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Calm™ Chamomile Filterbag Tea"], "product_desc": ["Keep chamomile and carry on. Rose petals swept away by a whiff of peppermint wind graze lemongrass lawns and lemon balm buttresses. Landing gently on a carpet of chamomile, they weightlessly wait to be steeped into your cup of serenity.", "INGREDIENTS: CHAMOMILE FLOWERS, HIBISCUS FLOWERS, SPEARMINT LEAVES, ROSE PETALS, LEMONGRASS, BLACKBERRY LEAVES, COLOR (TURMERIC, RIBOFLAVIN), PEPPERMINT LEAVES, SARSAPARILLA ROOT, LEMON BALM LEAF, LICORICE ROOT, NATURAL FLAVOR."], "product_price": ["4.95"]},
{"product_name": ["Refresh™ Mint Filterbag Tea"], "product_desc": ["Do your tastes run hot and cold? Here's the perfect tea for you. The rich flavor of the peppermint and the intensity of the spearmint jump, skip and roll down grassy hills while the warm hint of sweet tarragon wonders what all the rush is about.", "INGREDIENTS: PEPPERMINT, SPEARMINT, TARRAGON."], "product_price": ["4.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["White Starbucks® Coffee Company Handle Mug"], "product_desc": [], "product_price": ["12.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Black Starbucks® Coffee Company Handle Mug"], "product_desc": [], "product_price": ["12.95"]},
{"product_name": ["Silver Starbucks® Coffee Company Handle Mug"], "product_desc": [], "product_price": ["12.95"]},
{"product_name": ["Wild Sweet Orange Filterbag Tea"], "product_desc": ["The juiciest of oranges are wrangled into your cup by tangy hibiscus flowers twirling lassos of lemongrass. Proving that wild oranges don't need to be tamed, just understood.", "INGREDIENTS: LEMONGRASS, BLACKBERRY LEAVES, CITRIC ACID, ROSE HIPS, SPEARMINT LEAVES, COLOR (TURMERIC, RIBOFLAVIN), ORANGE PEEL, HIBISCUS FLOWERS, NATURAL FLAVOR, ROSE PETALS, NATURAL ORANGE ESSENCE, GINGER ROOT, LICORICE ROOT, LICORICE EXTRACT."], "product_price": ["4.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Taupe Speckled Handle Mug"], "product_desc": [], "product_price": ["8.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["White & Taupe Handle Mug"], "product_desc": [], "product_price": ["9.95"]},
{"product_name": ["Charcoal Mug"], "product_desc": [], "product_price": ["12.95"]},
{"product_name": ["Cold Brew Glass"], "product_desc": [], "product_price": ["9.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["White Floral Handle Mug"], "product_desc": [], "product_price": ["11.95"]},
{"product_name": ["Verismo® Stainless Steel Faceted Mug"], "product_desc": [], "product_price": ["10.17"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Cold Brew Cup - Matte Black"], "product_desc": [], "product_price": ["16.95"]},
{"product_name": ["Midnight Blue Stainless Steel Cold Cup"], "product_desc": [], "product_price": ["22.95"]},
{"product_name": ["Mug & Espresso Verismo® Pods Bundle"], "product_desc": [], "product_price": ["19.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Berry Stainless Steel Cold Cup"], "product_desc": [], "product_price": ["22.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Logo Cold Cup"], "product_desc": [], "product_price": ["12.95"]},
{"product_name": ["Flowering Drawings Cold Cup"], "product_desc": [], "product_price": ["16.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Coffee Plant Cherries Cold Cup"], "product_desc": [], "product_price": ["16.95"]},
{"product_name": ["Silver Stainless Steel Cold Cup"], "product_desc": [], "product_price": ["22.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Seafoam Green Stainless Steel Cold Cup"], "product_desc": [], "product_price": ["22.95"]},
{"product_name": ["Venti Sporty Acrylic Cold Cup Straws"], "product_desc": [], "product_price": ["4.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Birds & Flowers Cold Cup"], "product_desc": [], "product_price": ["16.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Glass Cold Cup"], "product_desc": [], "product_price": ["16.95"]},
{"product_name": ["Beetles Cold Cup"], "product_desc": [], "product_price": ["16.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Blue Pattern Cold Cup"], "product_desc": [], "product_price": ["16.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["San Francisco Cold Cup"], "product_desc": [], "product_price": ["16.95"]},
{"product_name": ["Ember® Temperature Control Mug"], "product_desc": [], "product_price": ["149.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Stainless Steel Clip Tumbler - Kelly Green"], "product_desc": [], "product_price": ["24.95"]},
{"product_name": ["Leaves & Lace Cold Cup"], "product_desc": [], "product_price": ["16.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Yellow Stainless Steel Tumbler"], "product_desc": [], "product_price": ["19.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Magenta Stainless Steel Tumbler"], "product_desc": [], "product_price": ["21.95"]},
{"product_name": ["Stainless Steel Clip Tumbler - Magenta"], "product_desc": [], "product_price": ["24.95"]},
{"product_name": ["Black Stainless Steel Tumbler"], "product_desc": [], "product_price": ["21.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Copper & Black Stainless Steel Tumbler"], "product_desc": [], "product_price": ["21.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Stainless Steel Clip Tumbler"], "product_desc": [], "product_price": ["24.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Shiny Silver & Black Stainless Steel Tumbler"], "product_desc": [], "product_price": ["18.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Ember® Charging Coaster"], "product_desc": [], "product_price": ["39.95"]},
{"product_name": ["Original Logo Double Wall Traveler"], "product_desc": [], "product_price": ["11.97"]},
{"product_name": ["Double Wall Traveler with Chalk Pen"], "product_desc": [], "product_price": ["19.95"]},
{"product_name": ["Brushed Silver & Black Stainless Steel Tumbler"], "product_desc": [], "product_price": ["24.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Awake™ English Breakfast Filterbag Tea"], "product_desc": ["There's a fork in the road. Pick it up, you might need it later. The sun peeks over the horizon through the clouds, a star streaks undetected across the sky and the world begins anew. This bold and flavorful blend of black teas will send you down the day's path wondering where it will take you and if it's possible to bring along a friend.", "INGREDIENTS: A BLEND OF BLACK TEAS."], "product_price": ["4.95"]},
{"product_name": ["Aqua Embossed Cold Cup"], "product_desc": [], "product_price": ["18.95"]},
{"product_name": ["Chai Tea Latte Concentrate"], "product_desc": ["You are a spicy one, aren't you? Like a drive through an exotic marketplace with the windows rolled down, this blend of black teas will fill your senses, while the sweet cinnamon, spicy ginger and fragrant cardamom flirtatiously grab the steering wheel to take you in another direction.", "INGREDIENTS: AN INFUSION OF (WATER, BLACK TEA, BLACK PEPPER, GINGER, CARDAMOM, CINNAMON, CLOVES, STAR ANISE, NATURAL FLAVORS), CANE SUGAR, HONEY, GINGER JUICE, NATURAL FLAVORS, VANILLA EXTRACT, CITRIC ACID."], "product_price": ["4.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Organic Chai Filterbag Tea"], "product_desc": ["You are a spicy one, aren't you? Like a drive through an exotic marketplace with the windows rolled down, this blend of black teas will fill your senses, while the sweet cinnamon, spicy ginger and fragrant cardamom flirtatiously grab the steering wheel to take you in another direction.", "INGREDIENTS: BLACK TEAS, GINGER, CINNAMON, BLACK PEPPER, CARDAMOM, CLOVES, STAR ANISE, ORGANICALLY GROWN."], "product_price": ["4.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Zen™ Iced Green Filterbag Tea, 24 count"], "product_desc": ["Find your place in the shade. Spearmint leaves and lemon verbena engage in a lively round of croquet in the lemongrass, then retreat to the shade of green tea's cool, verdant veranda for a leisurely game of mahjong.", "INGREDIENTS: GREEN TEA, LEMON VERBENA LEAVES, SPEARMINT LEAVES, LEMONGRASS, LEMON ESSENCE OIL."], "product_price": ["26.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Iced Peach Green Pitcher Packs"], "product_desc": ["Each artfully blended tea bag lets you brew iced green tea with a peachy sweetness and citrusy zing. Crisp, refreshing green tea has a natural sweetness when blended with juicy peach notes. Hints of lemon verbena and lemongrass add a sunny citrus finish.", "Each pitcher pack brews 64 fl oz of iced tea.", "Selecting from the world's top teas and botanicals, Teavana", " master blenders craft teas to infuse every day with brilliance.", "INGREDIENTS: GREEN TEA, LEMON VERBENA, NATURAL FLAVORS, SPEARMINT LEAVES, LICORICE ROOT, LEMONGRASS, LEMON BALM LEAVES, LEMON ESSENCE."], "product_price": ["7.95"]},
{"product_name": ["Iced Passion Tango® Pitcher Packs"], "product_desc": ["Each caffeine-free herbal tea bag is a refreshing welcome to the tropics. This punchy herbal blend combines the tart, tropical flavors of pineapple, passion fruit and hibiscus with a touch of lemongrass and sweet cinnamon spice.", "Each pitcher pack brews 64 fl oz of iced tea.", "Selecting from the world's top teas and botanicals, Teavana", " master blenders craft teas to infuse every day with brilliance.", "INGREDIENTS: HIBISCUS FLOWERS, CITRIC ACID, NATURAL FLAVORS, CINNAMON, APPLE, LICORICE ROOT, LEMONGRASS, FRUIT JUICE EXTRACT (COLOR)."], "product_price": ["7.95"]},
{"product_name": ["Washington State Double Wall Traveler"], "product_desc": [], "product_price": ["22.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Zen™ Filterbag Tea"], "product_desc": ["Find your inner green, then play at least nine holes. Through the screened front door, zingy lemongrass and spritely spearmint coax contemplative pan-fired green teas to come play. Calmly, lemon verbena opens the door and invites them all to a cup of tea.", "INGREDIENTS: GREEN TEA, LEMON VERBENA LEAVES, SPEARMINT LEAVES, LEMONGRASS, NATURAL FLAVORS."], "product_price": ["4.95"]},
{"product_name": ["Montana Double Wall Traveler"], "product_desc": [], "product_price": ["22.95"]},
{"product_name": ["Idaho Double Wall Traveler"], "product_desc": [], "product_price": ["22.95"]},
{"product_name": ["Sedona Double Wall Traveler"], "product_desc": [], "product_price": ["22.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["San Francisco Double Wall Traveler"], "product_desc": [], "product_price": ["22.95"]},
{"product_name": ["Denver Double Wall Traveler"], "product_desc": [], "product_price": ["22.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Ohio Double Wall Traveler"], "product_desc": [], "product_price": ["22.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Indianapolis Double Wall Traveler"], "product_desc": [], "product_price": ["22.95"]},
{"product_name": ["New York State Double Wall Traveler"], "product_desc": [], "product_price": ["22.95"]},
{"product_name": ["Georgia Double Wall Traveler"], "product_desc": [], "product_price": ["22.95"]},
{"product_name": ["Pennsylvania Double Wall Traveler"], "product_desc": [], "product_price": ["22.95"]},
{"product_name": ["North Carolina Double Wall Traveler"], "product_desc": [], "product_price": ["22.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Stainless Steel Travel Coffee Press"], "product_desc": [], "product_price": ["22.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Copper Coffee Press"], "product_desc": [], "product_price": ["99.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Stainless Steel Travel Coffee Press"], "product_desc": [], "product_price": ["34.95"]},
{"product_name": ["Chambord Coffee Press"], "product_desc": [], "product_price": ["49.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["ESPRO® Press"], "product_desc": [], "product_price": ["119.95"]},
{"product_name": ["Italian Roast Brewing Kit"], "product_desc": [], "product_price": ["58.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Acrylic Travel Coffee Press"], "product_desc": [], "product_price": ["19.95"]},
{"product_name": ["ESPRO® Press"], "product_desc": [], "product_price": ["99.95"]},
{"product_name": ["Moka Express Espresso Maker - Blue"], "product_desc": [], "product_price": ["39.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Moka Express Espresso Maker - Orange"], "product_desc": [], "product_price": ["39.95"]},
{"product_name": ["Moka Express Espresso Maker - Red"], "product_desc": [], "product_price": ["39.95"]},
{"product_name": ["Oscar Professional"], "product_desc": [], "product_price": ["1295.00"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Verismo® System by Starbucks"], "product_desc": [], "product_price": ["179.00"]},
{"product_name": ["Encore Coffee Grinder"], "product_desc": [], "product_price": ["139.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["FL7 Glass Tea Kettle"], "product_desc": [], "product_price": ["99.90"]},
{"product_name": ["Hand Grinder"], "product_desc": [], "product_price": ["59.95"]},
{"product_name": ["Assam Glass Teapot"], "product_desc": [], "product_price": ["34.95"]},
{"product_name": ["Hawaii Ka'u"], "product_desc": ["Sea turtles were basking in the sun and nesting on this land long before it was given the name Ka`u. Today, life in this sparsely populated part of Hawaii continues to be slow-paced. With the high elevation and cool nights, even the coffee cherries mature more slowly in Ka`u. And with deep, nutrient-rich volcanic soil, these farms are producing coffees coveted around the world for their distinctive sweetness. This coffee is a simple way to joyfully share life—the spirit of Aloha."], "product_price": ["24.50"]},
{"product_name": ["Stagg Pour-Over Kettle - Matte Black"], "product_desc": [], "product_price": ["79.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Cold Brew Kit"], "product_desc": [], "product_price": ["24.95"]},
{"product_name": ["Burundi Gitaba"], "product_desc": ["In the highlands of southern Burundi, experts at Gitaba washing station—renowned for delivering high-quality coffee year after year—are sharing their knowledge and offering technical support to local farmers. Together they’re improving coffee production during each step of the process. Cultivated in the Rutana Province—where this coffee flourishes under ideal growing conditions—the beans’ journey from farm to port is often challenging due to limited infrastructure and long travel distances.", "Well worth the effort, every sip astounds with an intense body and sweetness. But what really sets this coffee apart is the collaboration and hard work of farmers who understand the importance of their contribution: consistently high-quality beans help ensure excellence in the cup and a promising future."], "product_price": ["17.50"]},
{"product_name": ["Decaf Costa Rica Hacienda Alsacia®"], "product_desc": ["Hacienda Alsacia, in Costa Rica’s storied Alajuela Province, is a farm with an established history—and in 2013 it became a personal part of ours. Here at our very own coffee farm, we deepen our knowledge of agronomy, our research of sustainability, and our commitment to the farmers who work the land. And in cultivating, harvesting and tasting each year’s crop, we experience a feeling unlike any other: the pride of seeing our own beans through, from seedling to cup. We are honored to share this coffee, an exceptional example of the flavors we have come to know and love from high-grown Costa Rican coffees."], "product_price": ["14.50"]},
{"product_name": ["Sun-Dried Brazil Sertão"], "product_desc": ["The Sertão Estate is hailed as one of the first farms to produce coffee in Brazil’s Carmo de Minas region. Under José Isidoro Pereira and Nazareth Dias Pereira, three generations have thrived on the area’s steep, sprawling hillsides. With children and grandchildren now involved in running the farm, traditions are growing and evolving to include roasting and exporting coffee, and even sharing a coffee shop with the community.", "It’s a rich family legacy, and it culminates in a wonderfully distinctive flavor enhanced by the sun-dried method. Every cup unfolds with a bright, delicate sweetness, reflecting the deep connection between a family and the land they’ve come to know and love."], "product_price": ["17.50"]},
{"product_name": ["FC-100 Bonded Filters"], "product_desc": [], "product_price": ["11.95"]},
{"product_name": ["Hand Grinder"], "product_desc": [], "product_price": ["59.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Stainless Steel Coffee Press with Walnut Handle - Copper"], "product_desc": [], "product_price": ["49.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Rechargeable Coffee Scale"], "product_desc": [], "product_price": ["69.99"]},
{"product_name": ["Ceramic Coffee Canister"], "product_desc": [], "product_price": ["34.95"]},
{"product_name": ["Charcoal Mug"], "product_desc": [], "product_price": ["12.95"]},
{"product_name": ["Rwanda Abakundakawa"], "product_desc": ["\"We who love coffee.” This is the meaning of Abakundakawa, serving as a powerful mantra driving the farmers of this co-op to make their mark in Rwanda—and the coffee world at large. With a membership that’s nearly half women—a true rarity in the coffee world—this determined group lives up to its mission in various ways. Many of the women in the organization hold leadership roles, with their exemplary management culminating in award-winning coffees.", "From roasting and sampling on-site, to reinvesting income into school fees and community support, to moving toward fully organic processing methods, their pioneering ways produce a gorgeous coffee and an exceptional example. It is our second year offering Abakundakawa, and we are thrilled to witness the success of this remarkable group."], "product_price": ["12.50"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Clever® Coffee Dripper"], "product_desc": [], "product_price": ["21.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Papua New Guinea Roots No. 1"], "product_desc": ["On the remote southwest Pacific island of Papua New Guinea, rugged coastlines give way to mountainous stretches, lush rainforests and active volcanoes. Infrastructure ranges from spotty to nonexistent, making the distance from one community to the next seem that much greater. On a landmass roughly the size of California, 800 languages are spoken, each signifying its own subculture. Faced with all of these complexities, the 400 farmers of the Roots No. 1 collective took matters into their own hands.", "They combined their backyard crops and opened their own processing mill, allowing them to strictly control every step from growing to trading. And now, thanks to their efforts, we have the opportunity to proudly introduce this lot—rich in flavors of orange, lemon and honey."], "product_price": ["14.50"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["D.R. Congo Kawa Kabuya"], "product_desc": ["Against a postcard backdrop of snowcapped mountains and wild jungles, the Kawa Kabuya co-op is producing coffees of exceptional quality. The Lubero and Beni districts of the eastern Democratic Republic of Congo border the Virunga National Park, an otherworldly spectacle of biological diversity, populated with gorillas and chimpanzees. The same mountains that serve as home to these great apes provide an exceptional climate for coffee cultivation—cool nighttime temperatures help the fruit mature slowly and evenly.", "Challenges presented by the rugged landscape and a lack of infrastructure are overcome by farmers determined to share the region’s unbelievable flavors with the rest of the world. The co-op gives these farmers a forum to share knowledge and build momentum for the crops they’ve worked passionately to cultivate."], "product_price": ["12.50"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Charcoal Mug"], "product_desc": [], "product_price": ["16.95"]},
{"product_name": ["Pike Place® Roast"], "product_desc": ["From our first store in Seattle’s Pike Place Market to our coffeehouses around the world, customers requested a freshly brewed coffee they could enjoy throughout the day. So in 2008 our master blenders and roasters created it for you, a blend so consistent and harmonious that no single characteristic dominates—or disappears. A smooth, well-rounded blend of Latin American coffees with subtly rich flavors of cocoa and toasted nuts, it’s perfect for every day."], "product_price": ["12.95"]},
{"product_name": ["Espresso Roast"], "product_desc": ["Every espresso beverage we handcraft for you begins right here. Our master roasters coax the beans along, the heat taking them deep and dark—a recipe for caramelly sweetness so right it’s never been changed. The quest began in 1975 with a search for the perfect melding of beans and roast, ending months of intense experimentation later with the coffee you’re holding in your hand. A blend of beans from Latin America and Asia / Pacific, roasted the way only we can."], "product_price": ["12.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Chocolate Coconut Cold Brew Coffee Pitcher Packs"], "product_desc": ["Cold brew is a simple method that brews with time instead of heat for bold, cold, super-smooth coffee. Our unique flavor sachet, made with real cocoa peel, infuses your Nariño 70 cold brew coffee with rich notes of milk chocolate and toasted coconut. Using your favorite 48 fl oz (or larger) pitcher, simply add cold water and steep two pitcher packs and one flavor sachet in the fridge for 24 hours for cold brew coffee you can enjoy all week. You can also customize with milk or sugar to bring out even more flavor.", "Receive two pitcher packs and one flavor sachet, which together make six 8 fl oz servings.", "FLAVOR SACHET INGREDIENTS: NATURAL FLAVORS, DRIED COCOA PEELS."], "product_price": ["6.95"]},
{"product_name": ["Cold Brew Starter Set"], "product_desc": [], "product_price": ["35.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Caffè Verona®"], "product_desc": ["This is a coffee of one true love, and three names. We created it just for a Seattle restaurant in 1975, naming it Jake’s Blend. And people loved it. So many, in fact, that we began hand scooping and blending it to order in our stores, where it was known as 80/20 Blend, for the recipe. The love was so strong we finally made it official, calling it Verona after the city that inspires so many. By any name, this is a thing of pure romance."], "product_price": ["12.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Kenya"], "product_desc": ["Kenya’s high altitudes, ideal climate and strong traditions have helped place premium Kenyan coffees like this one among the world’s most treasured. And as it did when we introduced it in 1971, Kenya continues to astound our expert tasters and customers alike with flavors not commonly ascribed to coffee. Bright with a juicy acidity, low wine notes and fruity flavors—ranging from black currant and blackberry to tart grapefruit—that become more pronounced as the coffee cools."], "product_price": ["13.95"]},
{"product_name": ["Vanilla Cold Brew Set"], "product_desc": [], "product_price": ["40.95"]},
{"product_name": ["Sumatra"], "product_desc": ["Like the lush Indonesian island of its origin, this spicy coffee stands alone. Full-bodied with a smooth mouthfeel, lingering flavors of dried herbs and fresh earth, and almost no acidity. Our roasters love transforming these unpredictable beans from dark coral green to tiger-orange to a rich, oily mahogany, revealing bold flavors that many of us can’t live without. Coffee from Sumatra is the foundation of our most treasured blends, and something we’ve been honored to share with you for four decades."], "product_price": ["13.95"]},
{"product_name": ["Napoli Blend™"], "product_desc": ["Reminiscent of the bustling, treasured city of Naples, this dark, exotic ground coffee blend has a vibrant medium body and deep, roasty notes that darker-roast coffee connoisseurs will love. Notably versatile, Napoli Blend", " is wonderful prepared as a filter drip coffee and is just as delightful prepared as espresso."], "product_price": ["8.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Stainless Steel Coffee Press with Walnut Handle - Copper"], "product_desc": [], "product_price": ["49.95"]},
{"product_name": ["Organic Yukon Blend®"], "product_desc": ["Named after the North American wilderness, Organic Yukon Blend", " is a bold coffee for the adventurous at heart. Lively acidity and deep, earthy notes meld together in this classic blend. When you taste it, you get the balance and brightness of Latin American coffees along with the heft and the lingering herbal spiciness from Sumatran beans. Hearty, rugged and untamed—simply a great coffee."], "product_price": ["13.95"]},
{"product_name": ["Komodo Dragon® Blend"], "product_desc": ["Deep, untamed flavors ripple through. Earthy, herbal and complex with a lingering spice. The scent is like a stroll through the forest just after a rain. This is the essence of coffees from Indonesia, and no other beans bring these flavors. Our master coffee blenders have done something remarkable. Knitting together the best pieces of the region's coffees perfectly—allowing each taste to shine through clearly. It is an experience that would otherwise never exist. And is as extraordinary and wild as its namesake."], "product_price": ["13.95"]},
{"product_name": ["Veranda Blend®"], "product_desc": ["In Latin America, coffee farms are often run by families, with their own homes on the same land where their coffee grows. We’ve sipped coffee with these farmers for decades, sitting on their verandas, overlooking the lush beauty of the coffee trees rolling out in the distance. Most times it was a lightly roasted coffee like this one. It took us more than 80 tries to get it right—mellow and flavorful with a nice softness."], "product_price": ["12.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Perugia Blend™"], "product_desc": ["Begin experiencing this full-bodied, smooth blend by inhaling its wonderfully heady aroma. Then take that first delightful sip. Perugia Blend", " satisfies your search for the very essence of rich, medium-roast flavor. That's why it's also our choice Torrefazione Italia", " coffee blend for espresso and espresso drinks."], "product_price": ["8.95"]},
{"product_name": ["Dark Roast Coffee Variety Pack"], "product_desc": ["Discover deep flavor with these three bold and full-bodied Starbucks", " Dark Roast coffees. It takes just the right temperature and amount of time during the roasting process to bring our signature Starbucks", " Dark Roast coffees to their peak of aroma, acidity, body and flavor. The result is worth it: enjoy rich, well-balanced Starbucks", " Caffè Verona", ", bold and refined Starbucks", " Gold Coast Blend", ", and intensely flavorful Starbucks", " Italian Roast.", "This is a one-time delivery of three 1 lb bags of coffee."], "product_price": ["36.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Pike Place® Roast"], "product_desc": ["From our first store in Seattle’s Pike Place Market to our coffeehouses around the world, customers requested a freshly brewed coffee they could enjoy throughout the day. So in 2008 our master blenders and roasters created it for you, a blend so consistent and harmonious that no single characteristic dominates—or disappears. A smooth, well-rounded blend of Latin American coffees with subtly rich flavors of cocoa and toasted nuts, it’s perfect for every day."], "product_price": ["12.95"]},
{"product_name": ["VIA Instant Refreshers™ Very Berry Hibiscus"], "product_desc": ["Starbucks VIA Instant Refreshers", " Very Berry Hibiscus combines tangy blackberry with hints of hibiscus, sweet ginger and lemongrass, and pairs that with the natural energy from green, unroasted coffee beans. It's a breakthrough in instant refreshment that tastes nothing like coffee. Light, juicy and thirst-quenching, with a natural boost of caffeine to reenergize you. Enjoy Starbucks VIA Instant Refreshers", " single-serve packets wherever the moment takes you.", "INGREDIENTS: CANE SUGAR, GRAPE JUICE POWDERS (MALTODEXTRIN, GRAPE JUICE SOLIDS), NATURAL FLAVORS, FRUIT AND VEGETABLE JUICES FOR COLOR, MALIC ACID, GREEN COFFEE BEAN EXTRACT, ERYTHRITOL, CITRIC ACID, ASCORBIC ACID (VITAMIN C), REBAUDIOSIDE-A (STEVIA LEAF EXTRACT)."], "product_price": ["7.99"]},
{"product_name": ["VIA® Instant Sweetened Iced Coffee"], "product_desc": ["Create the best tasting beverages with these single-serve packets. Enjoy them anytime, anywhere—in an instant.", "INGREDIENTS: CANE SUGAR, INSTANT AND MICROGROUND COFFEE."], "product_price": ["5.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["VIA® Instant Caramel Flavored Iced Coffee"], "product_desc": ["Create the best tasting beverages with these single-serve packets. Enjoy them anytime, anywhere—in an instant.", "INGREDIENTS: CANE SUGAR, INSTANT AND MICROGROUND COFFEE, NATURAL FLAVORS, SALT."], "product_price": ["6.95"]},
{"product_name": ["VIA® Instant Vanilla Iced Coffee"], "product_desc": ["Create the best tasting beverages with these single-serve packets. Enjoy them anytime, anywhere—in an instant.", "INGREDIENTS: CANE SUGAR, INSTANT AND MICROGROUND COFFEE, NATURAL FLAVORS, SALT."], "product_price": ["5.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["VIA® Ready Brew House Blend"], "product_desc": ["It’s deceptively simple. A blend of fine Latin American beans roasted to a glistening, dark chestnut color. Loaded with flavor, balancing tastes of nut and cocoa, just a touch of sweetness from the roast. This coffee is our beginning, the very first blend we ever created for you back in 1971. And this one blend set the course for the way our master blenders and roasters work even today. A true reflection of us and a delicious cup of coffee, period. It all starts from here.", "Create the best tasting beverages with these single-serve packets. Enjoy them anytime, anywhere—in an instant."], "product_price": ["37.95"]},
{"product_name": ["VIA® Ready Brew Colombia"], "product_desc": ["We’ve always loved coffee from Colombia. And we’re never reminded of that love more than when we are traveling to visit the coffee farms. Driving treacherous dirt roads with only a sheer mountain wall to the right side—to the left nothing but air for thousands of feet. Sitting at 6,500 feet of elevation, nestled among the beautiful and distinctive Colombian countryside, these farms produce the very best of this amazing coffee. For us the round body, juicy taste and signature nutty finish are worth the journey every single time.", "Create the best tasting beverages with these single-serve packets. Enjoy them anytime, anywhere—in an instant."], "product_price": ["37.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["VIA® Ready Brew Pike Place® Roast"], "product_desc": ["From our first store in Seattle’s Pike Place Market to our coffeehouses around the world, customers requested a freshly brewed coffee they could enjoy throughout the day. So in 2008 our master blenders and roasters created it for you, a blend so consistent and harmonious that no single characteristic dominates—or disappears. A smooth, well-rounded blend of Latin American coffees with subtly rich flavors of cocoa and toasted nuts, it’s perfect for every day.", "Create the best tasting beverages with these single-serve packets. Enjoy them anytime, anywhere—in an instant."], "product_price": ["37.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["VIA® Veranda Blend®"], "product_desc": ["In Latin America, coffee farms are often run by families, with their own homes on the same land where their coffee grows. We’ve sipped coffee with these farmers for decades, sitting on their verandas, overlooking the lush beauty of the coffee trees rolling out in the distance. Most times it was a lightly roasted coffee like this one. It took us more than 80 tries to get it right—mellow and flavorful with a nice softness.", "Create the best tasting beverages with these single-serve packets. Enjoy them anytime, anywhere—in an instant."], "product_price": ["37.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["VIA® Instant Vanilla Latte"], "product_desc": ["Create the best tasting beverages with these single-serve packets. Enjoy them anytime, anywhere—in an instant.", "INGREDIENTS: DAIRY POWDER, SUGAR, INSTANT AND MICROGROUND ", " COFFEE, NATURAL FLAVORS.", "CONTAINS MILK."], "product_price": ["6.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["VIA® Ready Brew Pike Place® Roast"], "product_desc": ["From our first store in Seattle’s Pike Place Market to our coffeehouses around the world, customers requested a freshly brewed coffee they could enjoy throughout the day. So in 2008 our master blenders and roasters created it for you, a blend so consistent and harmonious that no single characteristic dominates—or disappears. A smooth, well-rounded blend of Latin American coffees with subtly rich flavors of cocoa and toasted nuts, it’s perfect for every day.", "Create the best tasting beverages with these single-serve packets. Enjoy them anytime, anywhere—in an instant."], "product_price": ["9.95"]},
{"product_name": ["VIA® Instant White Chocolate Mocha Latte"], "product_desc": ["Create the best tasting beverages with these single-serve packets. Enjoy them anytime, anywhere—in an instant.", "INGREDIENTS: SUGAR, DAIRY POWDER, INSTANT AND MICROGROUND COFFEE, NATURAL FLAVORS, SALT.", "CONTAINS MILK."], "product_price": ["6.95"]},
{"product_name": ["VIA® Ready Brew Colombia"], "product_desc": ["We’ve always loved coffee from Colombia. And we’re never reminded of that love more than when we are traveling to visit the coffee farms. Driving treacherous dirt roads with only a sheer mountain wall to the right side—to the left nothing but air for thousands of feet. Sitting at 6,500 feet of elevation, nestled among the beautiful and distinctive Colombian countryside, these farms produce the very best of this amazing coffee. For us the round body, juicy taste and signature nutty finish are worth the journey every single time.", "Create the best tasting beverages with these single-serve packets. Enjoy them anytime, anywhere—in an instant."], "product_price": ["9.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Cold Brew Kit"], "product_desc": [], "product_price": ["24.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Verismo® V Brewer"], "product_desc": [], "product_price": ["149.00"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Moccamaster KB741 Coffee Brewer - Black"], "product_desc": [], "product_price": ["329.95"]},
{"product_name": ["FC-100 Bonded Filters"], "product_desc": [], "product_price": ["11.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["H.A.N.D. Coffee Carafe Set"], "product_desc": [], "product_price": ["64.95"]},
{"product_name": ["Theo Slow Brew Coffee Maker"], "product_desc": [], "product_price": ["69.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Moka Express Espresso Maker - Blue"], "product_desc": [], "product_price": ["39.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Cold Brew System"], "product_desc": [], "product_price": ["34.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Classic Pour-Over Brewer #4"], "product_desc": [], "product_price": ["14.95"]},
{"product_name": ["Italian Roast Brewing Kit"], "product_desc": [], "product_price": ["58.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Pour-Over Cone - Onyx"], "product_desc": [], "product_price": ["15.95"]},
{"product_name": ["K500 Coffee Brewing System"], "product_desc": [], "product_price": ["189.00"]},
{"product_name": ["Vanilla Latte On the Go Bundle"], "product_desc": [], "product_price": ["25.95"]},
{"product_name": ["Cold Brew Growler"], "product_desc": [], "product_price": ["14.95"]},
{"product_name": ["Pour-Over Coffee Maker"], "product_desc": [], "product_price": ["39.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Moccamaster KBGT741 Coffee Maker - Polished Silver"], "product_desc": [], "product_price": ["319.00"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Guatemala Antigua Espresso Verismo® Pods"], "product_desc": ["The Antigua Valley of Guatemala is treasured for its 100-year-old farms, nutrient-rich volcanic soil and its coffee, which is the touchstone of quality. Farmers take enormous pride in traditions they've passed on for generations. As a result, the coffee you experience is rich and multidimensional, with a flavor that’s consistent, cup after cup—lemon, chocolate and soft spice notes with an elegant mouthfeel unique to this region. It’s why we loved this coffee back in ’71, and why we love it today. ", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés."], "product_price": ["42.95"]},
{"product_name": ["Blonde Espresso Roast Espresso Verismo® Pods"], "product_desc": ["Drawing on four decades of coffee artistry, we started by combining select Latin American and East African beans, and then carefully roasted them to coax out their sweet, vibrant notes. The result is delightfully well-rounded and wonderfully versatile—delicious hot or served over ice.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés."], "product_price": ["11.95"]},
{"product_name": ["Decaf Espresso Roast Espresso Verismo® Pods"], "product_desc": ["Every espresso beverage we handcraft for you begins right here. Our master roasters coax the beans along, the heat taking them deep and dark—a recipe for caramelly sweetness so right it’s never been changed. The quest began in 1975 with a search for the perfect melding of beans and roast, ending months of intense experimentation later with the coffee you’re holding in your hand. A blend of beans from Latin America and Asia / Pacific, roasted the way only we can.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés."], "product_price": ["42.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["House Blend Brewed Coffee Verismo® Pods"], "product_desc": ["It’s deceptively simple. A blend of fine Latin American beans roasted to a glistening, dark chestnut color. Loaded with flavor, balancing tastes of nut and cocoa, just a touch of sweetness from the roast. This coffee is our beginning, the very first blend we ever created for you back in 1971. And this one blend set the course for the way our master blenders and roasters work even today. A true reflection of us and a delicious cup of coffee, period. It all starts from here.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés."], "product_price": ["42.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Verismo® White Chocolate Mocha Kit"], "product_desc": ["Start your white chocolate mocha by brewing an Espresso Roast Verismo", " Pod, top with white chocolate sauce, give it a stir and enjoy. We suggest using the Verismo", " Milk Frother, and your milk of choice to make the most authentic mochas at home."], "product_price": ["33.90"]},
{"product_name": ["Caffè Latte Verismo® Pods"], "product_desc": ["Use the power of your Verismo", " System to craft a creamy Starbucks", " latte. Our recipe is simple and delicious: 100% ", " coffee pods deliver an exceptional shot of espresso, and milk powder pods create velvety milk so you can enjoy a 2% milk fat latte at the push of a button.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés.", "INGREDIENTS: DRY WHOLE MILK (30% MILK FAT), GROUND COFFEE."], "product_price": ["45.95"]},
{"product_name": ["Sumatra Brewed Coffee Verismo® Pods"], "product_desc": ["Like the lush Indonesian island of its origin, this spicy coffee stands alone. Full-bodied with a smooth mouthfeel, lingering flavors of dried herbs and fresh earth, and almost no acidity. Our roasters love transforming these unpredictable beans from dark coral green to tiger-orange to a rich, oily mahogany, revealing bold flavors that many of us can’t live without. Coffee from Sumatra is the foundation of our most treasured blends, and something we’ve been honored to share with you for four decades.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés."], "product_price": ["42.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Sumatra Brewed Coffee Verismo® Pods"], "product_desc": ["Like the lush Indonesian island of its origin, this spicy coffee stands alone. Full-bodied with a smooth mouthfeel, lingering flavors of dried herbs and fresh earth, and almost no acidity. Our roasters love transforming these unpredictable beans from dark coral green to tiger-orange to a rich, oily mahogany, revealing bold flavors that many of us can’t live without. Coffee from Sumatra is the foundation of our most treasured blends, and something we’ve been honored to share with you for four decades.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés."], "product_price": ["79.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Guatemala Antigua Espresso Verismo® Pods"], "product_desc": ["The Antigua Valley of Guatemala is treasured for its 100-year-old farms, nutrient-rich volcanic soil and its coffee, which is the touchstone of quality. Farmers take enormous pride in traditions they've passed on for generations. As a result, the coffee you experience is rich and multidimensional, with a flavor that’s consistent, cup after cup—lemon, chocolate and soft spice notes with an elegant mouthfeel unique to this region. It’s why we loved this coffee back in ’71, and why we love it today. ", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés."], "product_price": ["79.95"]},
{"product_name": ["Verismo® Caramel Macchiato Kit"], "product_desc": ["Start your caramel macchiato with vanilla syrup in the bottom of your cup, then brew an Espresso Roast Verismo", " Pod, and finish it with a drizzle of caramel sauce. Enjoy. We suggest using the Verismo", " Milk Frother, and your milk of choice to make the most authentic macchiatos at home."], "product_price": ["46.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Decaf Espresso Roast Espresso Verismo® Pods"], "product_desc": ["Every espresso beverage we handcraft for you begins right here. Our master roasters coax the beans along, the heat taking them deep and dark—a recipe for caramelly sweetness so right it’s never been changed. The quest began in 1975 with a search for the perfect melding of beans and roast, ending months of intense experimentation later with the coffee you’re holding in your hand. A blend of beans from Latin America and Asia / Pacific, roasted the way only we can.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés."], "product_price": ["79.95"]},
{"product_name": ["Masala Chai Tea Verismo® Pods"], "product_desc": ["With the touch of a button, enjoy the bold spice notes of this sweetened black tea. Or blend with fresh frothed milk or a Verismo", " milk pod for a velvety Chai Latte. It’s a sensory voyage without leaving the coziness of home.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés.", "INGREDIENTS: SUGAR, INSTANT TEA POWDER, NATURAL FLAVOR."], "product_price": ["42.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Colombia Brewed Coffee Verismo® Pods"], "product_desc": ["We’ve always loved coffee from Colombia. And we’re never reminded of that love more than when we are traveling to visit the coffee farms. Driving treacherous dirt roads with only a sheer mountain wall to the right side—to the left nothing but air for thousands of feet. Sitting at 6,500 feet of elevation, nestled among the beautiful and distinctive Colombian countryside, these farms produce the very best of this amazing coffee. For us the round body, juicy taste and signature nutty finish are worth the journey every single time.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés."], "product_price": ["79.95"]},
{"product_name": ["Veranda Blend® Brewed Coffee Verismo® Pods"], "product_desc": ["In Latin America, coffee farms are often run by families, with their own homes on the same land where their coffee grows. We’ve sipped coffee with these farmers for decades, sitting on their verandas, overlooking the lush beauty of the coffee trees rolling out in the distance. Most times it was a lightly roasted coffee like this one. It took us more than 80 tries to get it right—mellow and flavorful with a nice softness.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés."], "product_price": ["79.95"]},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": [], "product_desc": [], "product_price": []},
{"product_name": ["Caffè Latte Verismo® Pods"], "product_desc": ["Use the power of your Verismo", " System to craft a creamy Starbucks", " latte. Our recipe is simple and delicious: 100% ", " coffee pods deliver an exceptional shot of espresso, and milk powder pods create velvety milk so you can enjoy a 2% milk fat latte at the push of a button.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés.", "INGREDIENTS: DRY WHOLE MILK (30% MILK FAT), GROUND COFFEE."], "product_price": ["86.95"]},
{"product_name": ["Colombia Brewed Coffee Verismo® Pods"], "product_desc": ["We’ve always loved coffee from Colombia. And we’re never reminded of that love more than when we are traveling to visit the coffee farms. Driving treacherous dirt roads with only a sheer mountain wall to the right side—to the left nothing but air for thousands of feet. Sitting at 6,500 feet of elevation, nestled among the beautiful and distinctive Colombian countryside, these farms produce the very best of this amazing coffee. For us the round body, juicy taste and signature nutty finish are worth the journey every single time.", "For use exclusively with the Verismo", " System, these brewed coffee and espresso pods are made from Starbucks", " coffee perfectly ground and proportioned to deliver the flavors you love from our cafés."], "product_price": ["42.95"]}
]